package com.weather.app.model;

/**
 * Created by zengpu on 15/10/27.
 */
public  class JsonResponse {

    private static  JsonResponse jsonResponse;

    private JsonResponse(){};

    public synchronized static JsonResponse getInstance() {
        if (jsonResponse == null) {
            jsonResponse = new JsonResponse();
        }
        return jsonResponse;
    }

    public String getS1() {
        return s1;
    }

    public String getS2() {
        return s2;
    }

    public String getS3() {
        return S3;
    }

    public String getS4() {
        return S4;
    }

    public String getS5() {
        return S5;
    }

    public String getS6() {
        return S6;
    }

    public String getS7() {
        return S7;
    }

    public String getS8() {
        return S8;
    }

    private final static String s1="{\n" +
            "    \"status\": 200, \n" +
            "    \"message\": \"OK\", \n" +
            "    \"data\": [\n" +
            "        {\n" +
            "            \"areaid\": 101010100, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"北京\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101010200, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"海淀\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101010300, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"朝阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101010400, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"顺义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101010500, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"怀柔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101010600, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"通州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101010700, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"昌平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101010800, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"延庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101010900, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"丰台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101011000, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"石景山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101011100, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"大兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101011200, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"房山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101011300, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"密云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101011400, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"门头沟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101011500, \n" +
            "            \"prov\": \"北京\", \n" +
            "            \"city\": \"北京\", \n" +
            "            \"district\": \"平谷\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101020100, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"上海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101020200, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"闵行\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101020300, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"宝山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101020500, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"嘉定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101020600, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"浦东南汇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101020700, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"金山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101020800, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"青浦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101020900, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"松江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101021000, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"奉贤\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101021100, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"崇明\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101021200, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"徐家汇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101021300, \n" +
            "            \"prov\": \"上海\", \n" +
            "            \"city\": \"上海\", \n" +
            "            \"district\": \"浦东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030100, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"天津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030200, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"武清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030300, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"宝坻\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030400, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"东丽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030500, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"西青\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030600, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"北辰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030700, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"宁河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030800, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"汉沽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101030900, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"静海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101031000, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"津南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101031100, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"塘沽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101031200, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"大港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101031400, \n" +
            "            \"prov\": \"天津\", \n" +
            "            \"city\": \"天津\", \n" +
            "            \"district\": \"蓟县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040100, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"重庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040200, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"永川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040300, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"合川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040400, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"南川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040500, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"江津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040600, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"万盛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040700, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"渝北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040800, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"北碚\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101040900, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"巴南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041000, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"长寿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041100, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"黔江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041300, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"万州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041400, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"涪陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041500, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"开县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041600, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"城口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041700, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"云阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041800, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"巫溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101041900, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"奉节\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042000, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"巫山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042100, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"潼南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042200, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"垫江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042300, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"梁平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042400, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"忠县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042500, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"石柱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042600, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"大足\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042700, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"荣昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042800, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"铜梁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101042900, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"璧山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101043000, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"丰都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101043100, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"武隆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101043200, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"彭水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101043300, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"綦江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101043400, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"酉阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101043600, \n" +
            "            \"prov\": \"重庆\", \n" +
            "            \"city\": \"重庆\", \n" +
            "            \"district\": \"秀山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050101, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"哈尔滨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050102, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"双城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050103, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"呼兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050104, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"阿城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050105, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"宾县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050106, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"依兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050107, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"巴彦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050108, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"通河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050109, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"方正\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050110, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"延寿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050111, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"尚志\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050112, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"五常\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050113, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"哈尔滨\", \n" +
            "            \"district\": \"木兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050201, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"齐齐哈尔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050202, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"讷河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050203, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"龙江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050204, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"甘南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050205, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"富裕\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050206, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"依安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050207, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"拜泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050208, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"克山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050209, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"克东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050210, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"齐齐哈尔\", \n" +
            "            \"district\": \"泰来\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050301, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"牡丹江\", \n" +
            "            \"district\": \"牡丹江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050302, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"牡丹江\", \n" +
            "            \"district\": \"海林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050303, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"牡丹江\", \n" +
            "            \"district\": \"穆棱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050304, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"牡丹江\", \n" +
            "            \"district\": \"林口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050305, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"牡丹江\", \n" +
            "            \"district\": \"绥芬河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050306, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"牡丹江\", \n" +
            "            \"district\": \"宁安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050307, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"牡丹江\", \n" +
            "            \"district\": \"东宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050401, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"佳木斯\", \n" +
            "            \"district\": \"佳木斯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050402, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"佳木斯\", \n" +
            "            \"district\": \"汤原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050403, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"佳木斯\", \n" +
            "            \"district\": \"抚远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050404, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"佳木斯\", \n" +
            "            \"district\": \"桦川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050405, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"佳木斯\", \n" +
            "            \"district\": \"桦南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050406, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"佳木斯\", \n" +
            "            \"district\": \"同江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050407, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"佳木斯\", \n" +
            "            \"district\": \"富锦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050501, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"绥化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050502, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"肇东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050503, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"安达\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050504, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"海伦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050505, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"明水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050506, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"望奎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050507, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"兰西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050508, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"青冈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050509, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"庆安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050510, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"绥化\", \n" +
            "            \"district\": \"绥棱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050601, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"黑河\", \n" +
            "            \"district\": \"黑河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050602, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"黑河\", \n" +
            "            \"district\": \"嫩江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050603, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"黑河\", \n" +
            "            \"district\": \"孙吴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050604, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"黑河\", \n" +
            "            \"district\": \"逊克\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050605, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"黑河\", \n" +
            "            \"district\": \"五大连池\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050606, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"黑河\", \n" +
            "            \"district\": \"北安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050701, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大兴安岭\", \n" +
            "            \"district\": \"大兴安岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050702, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大兴安岭\", \n" +
            "            \"district\": \"塔河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050703, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大兴安岭\", \n" +
            "            \"district\": \"漠河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050704, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大兴安岭\", \n" +
            "            \"district\": \"呼玛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050705, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大兴安岭\", \n" +
            "            \"district\": \"呼中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050706, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大兴安岭\", \n" +
            "            \"district\": \"新林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050708, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大兴安岭\", \n" +
            "            \"district\": \"加格达奇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050801, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"伊春\", \n" +
            "            \"district\": \"伊春\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050802, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"伊春\", \n" +
            "            \"district\": \"乌伊岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050803, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"伊春\", \n" +
            "            \"district\": \"五营\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050804, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"伊春\", \n" +
            "            \"district\": \"铁力\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050805, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"伊春\", \n" +
            "            \"district\": \"嘉荫\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050901, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大庆\", \n" +
            "            \"district\": \"大庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050902, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大庆\", \n" +
            "            \"district\": \"林甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050903, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大庆\", \n" +
            "            \"district\": \"肇州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050904, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大庆\", \n" +
            "            \"district\": \"肇源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101050905, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"大庆\", \n" +
            "            \"district\": \"杜尔伯特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051002, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"七台河\", \n" +
            "            \"district\": \"七台河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051003, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"七台河\", \n" +
            "            \"district\": \"勃利\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051101, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"鸡西\", \n" +
            "            \"district\": \"鸡西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051102, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"鸡西\", \n" +
            "            \"district\": \"虎林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051103, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"鸡西\", \n" +
            "            \"district\": \"密山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051104, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"鸡西\", \n" +
            "            \"district\": \"鸡东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051201, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"鹤岗\", \n" +
            "            \"district\": \"鹤岗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051202, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"鹤岗\", \n" +
            "            \"district\": \"绥滨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051203, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"鹤岗\", \n" +
            "            \"district\": \"萝北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051301, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"双鸭山\", \n" +
            "            \"district\": \"双鸭山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051302, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"双鸭山\", \n" +
            "            \"district\": \"集贤\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051303, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"双鸭山\", \n" +
            "            \"district\": \"宝清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051304, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"双鸭山\", \n" +
            "            \"district\": \"饶河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101051305, \n" +
            "            \"prov\": \"黑龙江\", \n" +
            "            \"city\": \"双鸭山\", \n" +
            "            \"district\": \"友谊\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060101, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"长春\", \n" +
            "            \"district\": \"长春\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060102, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"长春\", \n" +
            "            \"district\": \"农安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060103, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"长春\", \n" +
            "            \"district\": \"德惠\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060104, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"长春\", \n" +
            "            \"district\": \"九台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060105, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"长春\", \n" +
            "            \"district\": \"榆树\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060106, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"长春\", \n" +
            "            \"district\": \"双阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060201, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"吉林\", \n" +
            "            \"district\": \"吉林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060202, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"吉林\", \n" +
            "            \"district\": \"舒兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060203, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"吉林\", \n" +
            "            \"district\": \"永吉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060204, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"吉林\", \n" +
            "            \"district\": \"蛟河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060205, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"吉林\", \n" +
            "            \"district\": \"磐石\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060206, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"吉林\", \n" +
            "            \"district\": \"桦甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060301, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"延边\", \n" +
            "            \"district\": \"延吉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060302, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"延边\", \n" +
            "            \"district\": \"敦化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060303, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"延边\", \n" +
            "            \"district\": \"安图\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060304, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"延边\", \n" +
            "            \"district\": \"汪清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060305, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"延边\", \n" +
            "            \"district\": \"和龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060307, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"延边\", \n" +
            "            \"district\": \"龙井\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060308, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"延边\", \n" +
            "            \"district\": \"珲春\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060309, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"延边\", \n" +
            "            \"district\": \"图们\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060401, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"四平\", \n" +
            "            \"district\": \"四平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060402, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"四平\", \n" +
            "            \"district\": \"双辽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060403, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"四平\", \n" +
            "            \"district\": \"梨树\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060404, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"四平\", \n" +
            "            \"district\": \"公主岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060405, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"四平\", \n" +
            "            \"district\": \"伊通\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060501, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"通化\", \n" +
            "            \"district\": \"通化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060502, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"通化\", \n" +
            "            \"district\": \"梅河口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060503, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"通化\", \n" +
            "            \"district\": \"柳河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060504, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"通化\", \n" +
            "            \"district\": \"辉南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060505, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"通化\", \n" +
            "            \"district\": \"集安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060506, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"通化\", \n" +
            "            \"district\": \"通化县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060601, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白城\", \n" +
            "            \"district\": \"白城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060602, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白城\", \n" +
            "            \"district\": \"洮南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060603, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白城\", \n" +
            "            \"district\": \"大安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060604, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白城\", \n" +
            "            \"district\": \"镇赉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060605, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白城\", \n" +
            "            \"district\": \"通榆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060701, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"辽源\", \n" +
            "            \"district\": \"辽源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060702, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"辽源\", \n" +
            "            \"district\": \"东丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060703, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"辽源\", \n" +
            "            \"district\": \"东辽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060801, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"松原\", \n" +
            "            \"district\": \"松原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060802, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"松原\", \n" +
            "            \"district\": \"乾安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060803, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"松原\", \n" +
            "            \"district\": \"前郭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060804, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"松原\", \n" +
            "            \"district\": \"长岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060805, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"松原\", \n" +
            "            \"district\": \"扶余\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060901, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白山\", \n" +
            "            \"district\": \"白山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060902, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白山\", \n" +
            "            \"district\": \"靖宇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060903, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白山\", \n" +
            "            \"district\": \"临江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060904, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白山\", \n" +
            "            \"district\": \"东岗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060905, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白山\", \n" +
            "            \"district\": \"长白\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060906, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白山\", \n" +
            "            \"district\": \"抚松\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101060907, \n" +
            "            \"prov\": \"吉林\", \n" +
            "            \"city\": \"白山\", \n" +
            "            \"district\": \"江源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070101, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"沈阳\", \n" +
            "            \"district\": \"沈阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070103, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"沈阳\", \n" +
            "            \"district\": \"辽中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070104, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"沈阳\", \n" +
            "            \"district\": \"康平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070105, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"沈阳\", \n" +
            "            \"district\": \"法库\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070106, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"沈阳\", \n" +
            "            \"district\": \"新民\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070201, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"大连\", \n" +
            "            \"district\": \"大连\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070202, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"大连\", \n" +
            "            \"district\": \"瓦房店\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070203, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"大连\", \n" +
            "            \"district\": \"金州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070204, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"大连\", \n" +
            "            \"district\": \"普兰店\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070205, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"大连\", \n" +
            "            \"district\": \"旅顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070206, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"大连\", \n" +
            "            \"district\": \"长海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070207, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"大连\", \n" +
            "            \"district\": \"庄河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070301, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"鞍山\", \n" +
            "            \"district\": \"鞍山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070302, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"鞍山\", \n" +
            "            \"district\": \"台安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070303, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"鞍山\", \n" +
            "            \"district\": \"岫岩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070304, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"鞍山\", \n" +
            "            \"district\": \"海城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070401, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"抚顺\", \n" +
            "            \"district\": \"抚顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070402, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"抚顺\", \n" +
            "            \"district\": \"新宾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070403, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"抚顺\", \n" +
            "            \"district\": \"清原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070404, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"抚顺\", \n" +
            "            \"district\": \"章党\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070501, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"本溪\", \n" +
            "            \"district\": \"本溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070502, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"本溪\", \n" +
            "            \"district\": \"本溪县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070504, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"本溪\", \n" +
            "            \"district\": \"桓仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070601, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"丹东\", \n" +
            "            \"district\": \"丹东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070602, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"丹东\", \n" +
            "            \"district\": \"凤城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070603, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"丹东\", \n" +
            "            \"district\": \"宽甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070604, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"丹东\", \n" +
            "            \"district\": \"东港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070701, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"锦州\", \n" +
            "            \"district\": \"锦州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070702, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"锦州\", \n" +
            "            \"district\": \"凌海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070704, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"锦州\", \n" +
            "            \"district\": \"义县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070705, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"锦州\", \n" +
            "            \"district\": \"黑山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070706, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"锦州\", \n" +
            "            \"district\": \"北镇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070801, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"营口\", \n" +
            "            \"district\": \"营口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070802, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"营口\", \n" +
            "            \"district\": \"大石桥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070803, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"营口\", \n" +
            "            \"district\": \"盖州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070901, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"阜新\", \n" +
            "            \"district\": \"阜新\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101070902, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"阜新\", \n" +
            "            \"district\": \"彰武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071001, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"辽阳\", \n" +
            "            \"district\": \"辽阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071002, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"辽阳\", \n" +
            "            \"district\": \"辽阳县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071003, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"辽阳\", \n" +
            "            \"district\": \"灯塔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071004, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"辽阳\", \n" +
            "            \"district\": \"弓长岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071101, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"铁岭\", \n" +
            "            \"district\": \"铁岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071102, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"铁岭\", \n" +
            "            \"district\": \"开原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071103, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"铁岭\", \n" +
            "            \"district\": \"昌图\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071104, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"铁岭\", \n" +
            "            \"district\": \"西丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071105, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"铁岭\", \n" +
            "            \"district\": \"调兵山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071201, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"朝阳\", \n" +
            "            \"district\": \"朝阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071203, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"朝阳\", \n" +
            "            \"district\": \"凌源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071204, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"朝阳\", \n" +
            "            \"district\": \"喀左\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071205, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"朝阳\", \n" +
            "            \"district\": \"北票\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071207, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"朝阳\", \n" +
            "            \"district\": \"建平县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071301, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"盘锦\", \n" +
            "            \"district\": \"盘锦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071302, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"盘锦\", \n" +
            "            \"district\": \"大洼\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071303, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"盘锦\", \n" +
            "            \"district\": \"盘山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071401, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"葫芦岛\", \n" +
            "            \"district\": \"葫芦岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071402, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"葫芦岛\", \n" +
            "            \"district\": \"建昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071403, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"葫芦岛\", \n" +
            "            \"district\": \"绥中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101071404, \n" +
            "            \"prov\": \"辽宁\", \n" +
            "            \"city\": \"葫芦岛\", \n" +
            "            \"district\": \"兴城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080101, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼和浩特\", \n" +
            "            \"district\": \"呼和浩特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080102, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼和浩特\", \n" +
            "            \"district\": \"土左旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080103, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼和浩特\", \n" +
            "            \"district\": \"托县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080104, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼和浩特\", \n" +
            "            \"district\": \"和林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080105, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼和浩特\", \n" +
            "            \"district\": \"清水河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080106, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼和浩特\", \n" +
            "            \"district\": \"呼市郊区\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080107, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼和浩特\", \n" +
            "            \"district\": \"武川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080201, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"包头\", \n" +
            "            \"district\": \"包头\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080202, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"包头\", \n" +
            "            \"district\": \"白云鄂博\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080203, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"包头\", \n" +
            "            \"district\": \"满都拉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080204, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"包头\", \n" +
            "            \"district\": \"土右旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080205, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"包头\", \n" +
            "            \"district\": \"固阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080206, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"包头\", \n" +
            "            \"district\": \"达茂旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080207, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"包头\", \n" +
            "            \"district\": \"希拉穆仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080301, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌海\", \n" +
            "            \"district\": \"乌海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080401, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"集宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080402, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"卓资\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080403, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"化德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080404, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"商都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080406, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"兴和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080407, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"凉城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080408, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"察右前旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080409, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"察右中旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080410, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"察右后旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080411, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"四子王旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080412, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"乌兰察布\", \n" +
            "            \"district\": \"丰镇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080501, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"通辽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080502, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"舍伯吐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080503, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"科左中旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080504, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"科左后旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080505, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"青龙山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080506, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"开鲁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080507, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"库伦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080508, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"奈曼\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080509, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"扎鲁特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080510, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"高力板\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080511, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"巴雅尔吐胡硕\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080601, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"赤峰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080603, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"阿鲁旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080604, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"浩尔吐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080605, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"巴林左旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080606, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"巴林右旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080607, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"林西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080608, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"克什克腾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080609, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"翁牛特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080610, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"岗子\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080611, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"喀喇沁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080612, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"八里罕\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080613, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"宁城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080614, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"敖汉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080615, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"赤峰\", \n" +
            "            \"district\": \"宝国吐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080701, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"鄂尔多斯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080703, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"达拉特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080704, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"准格尔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080705, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"鄂前旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080706, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"河南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080707, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"伊克乌素\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080708, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"鄂托克\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080709, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"杭锦旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080710, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"乌审旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080711, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"伊金霍洛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080712, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"乌审召\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080713, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"鄂尔多斯\", \n" +
            "            \"district\": \"东胜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080801, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"临河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080802, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"五原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080803, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"磴口\"\n" +
            "        }, ";

    private final static String s2="        {\n" +
            "            \"areaid\": 101080804, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"乌前旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080805, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"大佘太\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080806, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"乌中旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080807, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"乌后旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080808, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"海力素\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080809, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"那仁宝力格\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080810, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"巴彦淖尔\", \n" +
            "            \"district\": \"杭锦后旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080901, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"锡林浩特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080903, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"二连浩特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080904, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"阿巴嘎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080906, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"苏左旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080907, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"苏右旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080908, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"朱日和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080909, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"东乌旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080910, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"西乌旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080911, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"太仆寺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080912, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"镶黄旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080913, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"正镶白旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080914, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"正蓝旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080915, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"多伦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080916, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"博克图\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101080917, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"锡林郭勒\", \n" +
            "            \"district\": \"乌拉盖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081001, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"海拉尔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081002, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"小二沟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081003, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"阿荣旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081004, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"莫力达瓦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081005, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"鄂伦春旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081006, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"鄂温克旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081007, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"陈旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081008, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"新左旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081009, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"新右旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081010, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"满洲里\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081011, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"牙克石\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081012, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"扎兰屯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081014, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"额尔古纳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081015, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"根河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081016, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"呼伦贝尔\", \n" +
            "            \"district\": \"图里河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081101, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"乌兰浩特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081102, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"阿尔山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081103, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"科右中旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081104, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"胡尔勒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081105, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"扎赉特\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081106, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"索伦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081107, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"突泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081108, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"通辽\", \n" +
            "            \"district\": \"霍林郭勒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081109, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"兴安盟\", \n" +
            "            \"district\": \"科右前旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081201, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"阿左旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081202, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"阿右旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081203, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"额济纳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081204, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"拐子湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081205, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"吉兰太\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081206, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"锡林高勒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081207, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"头道湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081208, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"中泉子\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081209, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"诺尔公\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081210, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"雅布赖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081211, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"乌斯泰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101081212, \n" +
            "            \"prov\": \"内蒙古\", \n" +
            "            \"city\": \"阿拉善盟\", \n" +
            "            \"district\": \"孪井滩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090101, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"石家庄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090102, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"井陉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090103, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"正定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090104, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"栾城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090105, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"行唐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090106, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"灵寿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090107, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"高邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090108, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"深泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090109, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"赞皇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090110, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"无极\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090111, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"平山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090112, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"元氏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090113, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"赵县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090114, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"辛集\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090115, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"藁城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090116, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"晋州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090117, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"新乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090118, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"石家庄\", \n" +
            "            \"district\": \"鹿泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090201, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"保定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090202, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"满城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090203, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"阜平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090204, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"徐水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090205, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"唐县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090206, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"高阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090207, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"容城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090209, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"涞源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090210, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"望都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090211, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"安新\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090212, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"易县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090214, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"曲阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090215, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"蠡县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090216, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"顺平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090217, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"雄县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090218, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"涿州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090219, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"定州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090220, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"安国\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090221, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"高碑店\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090222, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"涞水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090223, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"定兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090224, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"清苑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090225, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"保定\", \n" +
            "            \"district\": \"博野\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090301, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"张家口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090302, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"宣化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090303, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"张北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090304, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"康保\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090305, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"沽源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090306, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"尚义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090307, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"蔚县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090308, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"阳原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090309, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"怀安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090310, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"万全\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090311, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"怀来\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090312, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"涿鹿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090313, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"赤城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090314, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"张家口\", \n" +
            "            \"district\": \"崇礼\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090402, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"承德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090403, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"承德县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090404, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"兴隆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090405, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"平泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090406, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"滦平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090407, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"隆化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090408, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"丰宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090409, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"宽城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090410, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"承德\", \n" +
            "            \"district\": \"围场\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090501, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"唐山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090502, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"丰南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090503, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"丰润\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090504, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"滦县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090505, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"滦南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090506, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"乐亭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090507, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"迁西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090508, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"玉田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090509, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"唐海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090510, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"遵化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090511, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"迁安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090512, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"唐山\", \n" +
            "            \"district\": \"曹妃甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090601, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"廊坊\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090602, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"固安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090603, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"永清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090604, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"香河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090605, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"大城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090606, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"文安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090607, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"大厂\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090608, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"霸州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090609, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"廊坊\", \n" +
            "            \"district\": \"三河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090701, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"沧州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090702, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"青县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090703, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"东光\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090704, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"海兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090705, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"盐山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090706, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"肃宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090707, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"南皮\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090708, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"吴桥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090709, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"献县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090710, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"孟村\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090711, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"泊头\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090712, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"任丘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090713, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"黄骅\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090714, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"河间\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090716, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"沧州\", \n" +
            "            \"district\": \"沧县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090801, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"衡水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090802, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"枣强\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090803, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"武邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090804, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"武强\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090805, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"饶阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090806, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"安平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090807, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"故城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090808, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"景县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090809, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"阜城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090810, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"冀州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090811, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"衡水\", \n" +
            "            \"district\": \"深州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090901, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"邢台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090902, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"临城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090904, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"内丘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090905, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"柏乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090906, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"隆尧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090907, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"南和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090908, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"宁晋\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090909, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"巨鹿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090910, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"新河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090911, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"广宗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090912, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"平乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090913, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"威县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090914, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"清河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090915, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"临西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090916, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"南宫\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090917, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"沙河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101090918, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邢台\", \n" +
            "            \"district\": \"任县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091001, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"邯郸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091002, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"峰峰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091003, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"临漳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091004, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"成安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091005, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"大名\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091006, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"涉县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091007, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"磁县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091008, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"肥乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091009, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"永年\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091010, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"邱县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091011, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"鸡泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091012, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"广平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091013, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"馆陶\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091014, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"魏县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091015, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"曲周\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091016, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"邯郸\", \n" +
            "            \"district\": \"武安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091101, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"秦皇岛\", \n" +
            "            \"district\": \"秦皇岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091102, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"秦皇岛\", \n" +
            "            \"district\": \"青龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091103, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"秦皇岛\", \n" +
            "            \"district\": \"昌黎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091104, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"秦皇岛\", \n" +
            "            \"district\": \"抚宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091105, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"秦皇岛\", \n" +
            "            \"district\": \"卢龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101091106, \n" +
            "            \"prov\": \"河北\", \n" +
            "            \"city\": \"秦皇岛\", \n" +
            "            \"district\": \"北戴河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100101, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"太原\", \n" +
            "            \"district\": \"太原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100102, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"太原\", \n" +
            "            \"district\": \"清徐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100103, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"太原\", \n" +
            "            \"district\": \"阳曲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100104, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"太原\", \n" +
            "            \"district\": \"娄烦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100105, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"太原\", \n" +
            "            \"district\": \"古交\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100106, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"太原\", \n" +
            "            \"district\": \"尖草坪区\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100107, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"太原\", \n" +
            "            \"district\": \"小店区\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100201, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"大同\", \n" +
            "            \"district\": \"大同\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100202, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"大同\", \n" +
            "            \"district\": \"阳高\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100203, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"大同\", \n" +
            "            \"district\": \"大同县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100204, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"大同\", \n" +
            "            \"district\": \"天镇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100205, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"大同\", \n" +
            "            \"district\": \"广灵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100206, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"大同\", \n" +
            "            \"district\": \"灵丘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100207, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"大同\", \n" +
            "            \"district\": \"浑源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100208, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"大同\", \n" +
            "            \"district\": \"左云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100301, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"阳泉\", \n" +
            "            \"district\": \"阳泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100302, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"阳泉\", \n" +
            "            \"district\": \"盂县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100303, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"阳泉\", \n" +
            "            \"district\": \"平定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100401, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"晋中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100402, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"榆次\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100403, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"榆社\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100404, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"左权\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100405, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"和顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100406, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"昔阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100407, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"寿阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100408, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"太谷\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100409, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"祁县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100410, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"平遥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100411, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"灵石\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100412, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋中\", \n" +
            "            \"district\": \"介休\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100501, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"长治\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100502, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"黎城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100503, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"屯留\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100504, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"潞城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100505, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"襄垣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100506, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"平顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100507, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"武乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100508, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"沁县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100509, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"长子\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100510, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"沁源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100511, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"长治\", \n" +
            "            \"district\": \"壶关\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100601, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋城\", \n" +
            "            \"district\": \"晋城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100602, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋城\", \n" +
            "            \"district\": \"沁水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100603, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋城\", \n" +
            "            \"district\": \"阳城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100604, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋城\", \n" +
            "            \"district\": \"陵川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100605, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋城\", \n" +
            "            \"district\": \"高平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100606, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"晋城\", \n" +
            "            \"district\": \"泽州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100701, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"临汾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100702, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"曲沃\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100703, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"永和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100704, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"隰县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100705, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"大宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100706, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"吉县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100707, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"襄汾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100708, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"蒲县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100709, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"汾西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100710, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"洪洞\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100711, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"霍州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100712, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"乡宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100713, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"翼城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100714, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"侯马\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100715, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"浮山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100716, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"安泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100717, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"临汾\", \n" +
            "            \"district\": \"古县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100801, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"运城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100802, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"临猗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100803, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"稷山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100804, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"万荣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100805, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"河津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100806, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"新绛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100807, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"绛县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100808, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"闻喜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100809, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"垣曲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100810, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"永济\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100811, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"芮城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100812, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"夏县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100813, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"运城\", \n" +
            "            \"district\": \"平陆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100901, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"朔州\", \n" +
            "            \"district\": \"朔州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100902, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"朔州\", \n" +
            "            \"district\": \"平鲁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100903, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"朔州\", \n" +
            "            \"district\": \"山阴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100904, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"朔州\", \n" +
            "            \"district\": \"右玉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100905, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"朔州\", \n" +
            "            \"district\": \"应县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101100906, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"朔州\", \n" +
            "            \"district\": \"怀仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101001, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"忻州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101002, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"定襄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101003, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"五台县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101004, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"河曲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101005, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"偏关\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101006, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"神池\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101007, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"宁武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101008, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"代县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101009, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"繁峙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101010, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"五台山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101011, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"保德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101012, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"静乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101013, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"岢岚\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101014, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"五寨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101015, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"忻州\", \n" +
            "            \"district\": \"原平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101100, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"吕梁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101101, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"离石\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101102, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"临县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101103, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"兴县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101104, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"岚县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101105, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"柳林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101106, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"石楼\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101107, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"方山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101108, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"交口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101109, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"中阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101110, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"孝义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101111, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"汾阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101112, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"文水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101101113, \n" +
            "            \"prov\": \"山西\", \n" +
            "            \"city\": \"吕梁\", \n" +
            "            \"district\": \"交城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110101, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"西安\", \n" +
            "            \"district\": \"西安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110102, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"西安\", \n" +
            "            \"district\": \"长安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110103, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"西安\", \n" +
            "            \"district\": \"临潼\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110104, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"西安\", \n" +
            "            \"district\": \"蓝田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110105, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"西安\", \n" +
            "            \"district\": \"周至\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110106, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"西安\", \n" +
            "            \"district\": \"户县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110107, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"西安\", \n" +
            "            \"district\": \"高陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110200, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"咸阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110201, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"三原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110202, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"礼泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110203, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"永寿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110204, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"淳化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110205, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"泾阳\"\n" +
            "        }, ";

    private  final static String S3="        {\n" +
            "            \"areaid\": 101110206, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"武功\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110207, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"乾县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110208, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"彬县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110209, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"长武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110210, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"旬邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110211, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"咸阳\", \n" +
            "            \"district\": \"兴平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110300, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"延安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110301, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"延长\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110302, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"延川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110303, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"子长\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110304, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"宜川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110305, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"富县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110306, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"志丹\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110307, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"安塞\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110308, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"甘泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110309, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"洛川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110310, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"黄陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110311, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"黄龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110312, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"延安\", \n" +
            "            \"district\": \"吴起\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110401, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"榆林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110402, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"府谷\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110403, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"神木\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110404, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"佳县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110405, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"定边\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110406, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"靖边\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110407, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"横山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110408, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"米脂\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110409, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"子洲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110410, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"绥德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110411, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"吴堡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110412, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"清涧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110413, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"榆林\", \n" +
            "            \"district\": \"榆阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110501, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"渭南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110502, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"华县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110503, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"潼关\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110504, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"大荔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110505, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"白水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110506, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"富平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110507, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"蒲城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110508, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"澄城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110509, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"合阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110510, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"韩城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110511, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"渭南\", \n" +
            "            \"district\": \"华阴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110601, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"商洛\", \n" +
            "            \"district\": \"商洛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110602, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"商洛\", \n" +
            "            \"district\": \"洛南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110603, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"商洛\", \n" +
            "            \"district\": \"柞水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110604, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"商洛\", \n" +
            "            \"district\": \"商州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110605, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"商洛\", \n" +
            "            \"district\": \"镇安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110606, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"商洛\", \n" +
            "            \"district\": \"丹凤\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110607, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"商洛\", \n" +
            "            \"district\": \"商南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110608, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"商洛\", \n" +
            "            \"district\": \"山阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110701, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"安康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110702, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"紫阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110703, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"石泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110704, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"汉阴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110705, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"旬阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110706, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"岚皋\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110707, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"平利\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110708, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"白河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110709, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"镇坪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110710, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"安康\", \n" +
            "            \"district\": \"宁陕\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110801, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"汉中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110802, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"略阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110803, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"勉县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110804, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"留坝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110805, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"洋县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110806, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"城固\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110807, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"西乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110808, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"佛坪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110809, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"宁强\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110810, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"南郑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110811, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"汉中\", \n" +
            "            \"district\": \"镇巴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110901, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"宝鸡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110903, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"千阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110904, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"麟游\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110905, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"岐山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110906, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"凤翔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110907, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"扶风\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110908, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"眉县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110909, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"太白\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110910, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"凤县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110911, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"陇县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101110912, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"宝鸡\", \n" +
            "            \"district\": \"陈仓\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101111001, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"铜川\", \n" +
            "            \"district\": \"铜川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101111002, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"铜川\", \n" +
            "            \"district\": \"耀县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101111003, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"铜川\", \n" +
            "            \"district\": \"宜君\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101111004, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"铜川\", \n" +
            "            \"district\": \"耀州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101111101, \n" +
            "            \"prov\": \"陕西\", \n" +
            "            \"city\": \"杨凌\", \n" +
            "            \"district\": \"杨凌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120101, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济南\", \n" +
            "            \"district\": \"济南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120102, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济南\", \n" +
            "            \"district\": \"长清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120103, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济南\", \n" +
            "            \"district\": \"商河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120104, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济南\", \n" +
            "            \"district\": \"章丘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120105, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济南\", \n" +
            "            \"district\": \"平阴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120106, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济南\", \n" +
            "            \"district\": \"济阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120201, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"青岛\", \n" +
            "            \"district\": \"青岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120202, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"青岛\", \n" +
            "            \"district\": \"崂山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120204, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"青岛\", \n" +
            "            \"district\": \"即墨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120205, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"青岛\", \n" +
            "            \"district\": \"胶州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120206, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"青岛\", \n" +
            "            \"district\": \"黄岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120207, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"青岛\", \n" +
            "            \"district\": \"莱西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120208, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"青岛\", \n" +
            "            \"district\": \"平度\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120301, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"淄博\", \n" +
            "            \"district\": \"淄博\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120302, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"淄博\", \n" +
            "            \"district\": \"淄川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120303, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"淄博\", \n" +
            "            \"district\": \"博山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120304, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"淄博\", \n" +
            "            \"district\": \"高青\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120305, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"淄博\", \n" +
            "            \"district\": \"周村\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120306, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"淄博\", \n" +
            "            \"district\": \"沂源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120307, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"淄博\", \n" +
            "            \"district\": \"桓台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120308, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"淄博\", \n" +
            "            \"district\": \"临淄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120401, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"德州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120402, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"武城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120403, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"临邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120404, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"陵县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120405, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"齐河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120406, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"乐陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120407, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"庆云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120408, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"平原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120409, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"宁津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120410, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"夏津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120411, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"德州\", \n" +
            "            \"district\": \"禹城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120501, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"烟台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120502, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"莱州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120503, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"长岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120504, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"蓬莱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120505, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"龙口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120506, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"招远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120507, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"栖霞\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120508, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"福山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120509, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"牟平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120510, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"莱阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120511, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"烟台\", \n" +
            "            \"district\": \"海阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120601, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"潍坊\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120602, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"青州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120603, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"寿光\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120604, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"临朐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120605, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"昌乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120606, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"昌邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120607, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"安丘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120608, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"高密\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120609, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"潍坊\", \n" +
            "            \"district\": \"诸城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120701, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"济宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120702, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"嘉祥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120703, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"微山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120704, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"鱼台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120705, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"兖州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120706, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"金乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120707, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"汶上\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120708, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"泗水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120709, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"梁山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120710, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"曲阜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120711, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"济宁\", \n" +
            "            \"district\": \"邹城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120801, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"泰安\", \n" +
            "            \"district\": \"泰安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120802, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"泰安\", \n" +
            "            \"district\": \"新泰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120804, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"泰安\", \n" +
            "            \"district\": \"肥城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120805, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"泰安\", \n" +
            "            \"district\": \"东平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120806, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"泰安\", \n" +
            "            \"district\": \"宁阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120901, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"临沂\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120902, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"莒南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120903, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"沂南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120904, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"兰陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120905, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"临沭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120906, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"郯城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120907, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"蒙阴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120908, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"平邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120909, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"费县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101120910, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"临沂\", \n" +
            "            \"district\": \"沂水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121001, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"菏泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121002, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"鄄城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121003, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"郓城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121004, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"东明\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121005, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"定陶\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121006, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"巨野\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121007, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"曹县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121008, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"成武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121009, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"菏泽\", \n" +
            "            \"district\": \"单县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121101, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"滨州\", \n" +
            "            \"district\": \"滨州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121102, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"滨州\", \n" +
            "            \"district\": \"博兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121103, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"滨州\", \n" +
            "            \"district\": \"无棣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121104, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"滨州\", \n" +
            "            \"district\": \"阳信\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121105, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"滨州\", \n" +
            "            \"district\": \"惠民\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121106, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"滨州\", \n" +
            "            \"district\": \"沾化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121107, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"滨州\", \n" +
            "            \"district\": \"邹平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121201, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"东营\", \n" +
            "            \"district\": \"东营\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121202, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"东营\", \n" +
            "            \"district\": \"河口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121203, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"东营\", \n" +
            "            \"district\": \"垦利\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121204, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"东营\", \n" +
            "            \"district\": \"利津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121205, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"东营\", \n" +
            "            \"district\": \"广饶\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121301, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"威海\", \n" +
            "            \"district\": \"威海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121302, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"威海\", \n" +
            "            \"district\": \"文登\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121303, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"威海\", \n" +
            "            \"district\": \"荣成\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121304, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"威海\", \n" +
            "            \"district\": \"乳山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121305, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"威海\", \n" +
            "            \"district\": \"成山头\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121306, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"威海\", \n" +
            "            \"district\": \"石岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121401, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"枣庄\", \n" +
            "            \"district\": \"枣庄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121402, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"枣庄\", \n" +
            "            \"district\": \"薛城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121403, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"枣庄\", \n" +
            "            \"district\": \"峄城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121404, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"枣庄\", \n" +
            "            \"district\": \"台儿庄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121405, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"枣庄\", \n" +
            "            \"district\": \"滕州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121501, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"日照\", \n" +
            "            \"district\": \"日照\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121502, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"日照\", \n" +
            "            \"district\": \"五莲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121503, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"日照\", \n" +
            "            \"district\": \"莒县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121601, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"莱芜\", \n" +
            "            \"district\": \"莱芜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121701, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"聊城\", \n" +
            "            \"district\": \"聊城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121702, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"聊城\", \n" +
            "            \"district\": \"冠县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121703, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"聊城\", \n" +
            "            \"district\": \"阳谷\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121704, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"聊城\", \n" +
            "            \"district\": \"高唐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121705, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"聊城\", \n" +
            "            \"district\": \"茌平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121706, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"聊城\", \n" +
            "            \"district\": \"东阿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121707, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"聊城\", \n" +
            "            \"district\": \"临清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101121709, \n" +
            "            \"prov\": \"山东\", \n" +
            "            \"city\": \"聊城\", \n" +
            "            \"district\": \"莘县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130101, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"乌鲁木齐\", \n" +
            "            \"district\": \"乌鲁木齐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130103, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"乌鲁木齐\", \n" +
            "            \"district\": \"小渠子\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130105, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"乌鲁木齐\", \n" +
            "            \"district\": \"达坂城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130108, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"乌鲁木齐\", \n" +
            "            \"district\": \"乌鲁木齐牧试站\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130109, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"乌鲁木齐\", \n" +
            "            \"district\": \"天池\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130110, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"乌鲁木齐\", \n" +
            "            \"district\": \"白杨沟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130201, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"克拉玛依\", \n" +
            "            \"district\": \"克拉玛依\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130202, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"克拉玛依\", \n" +
            "            \"district\": \"乌尔禾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130203, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"克拉玛依\", \n" +
            "            \"district\": \"白碱滩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130301, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"石河子\", \n" +
            "            \"district\": \"石河子\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130302, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"石河子\", \n" +
            "            \"district\": \"炮台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130303, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"石河子\", \n" +
            "            \"district\": \"莫索湾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130401, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"昌吉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130402, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"呼图壁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130403, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"米泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130404, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"阜康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130405, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"吉木萨尔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130406, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"奇台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130407, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"玛纳斯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130408, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"木垒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130409, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"昌吉\", \n" +
            "            \"district\": \"蔡家湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130501, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"吐鲁番\", \n" +
            "            \"district\": \"吐鲁番\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130502, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"吐鲁番\", \n" +
            "            \"district\": \"托克逊\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130504, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"吐鲁番\", \n" +
            "            \"district\": \"鄯善\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130601, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"库尔勒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130602, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"轮台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130603, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"尉犁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130604, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"若羌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130605, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"且末\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130606, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"和静\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130607, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"焉耆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130608, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"和硕\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130610, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"巴音布鲁克\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130611, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"铁干里克\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130612, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"博湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130613, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"塔中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130614, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"巴音郭楞\", \n" +
            "            \"district\": \"巴仑台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130701, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿拉尔\", \n" +
            "            \"district\": \"阿拉尔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130801, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"阿克苏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130802, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"乌什\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130803, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"温宿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130804, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"拜城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130805, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"新和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130806, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"沙雅\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130807, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"库车\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130808, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"柯坪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130809, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿克苏\", \n" +
            "            \"district\": \"阿瓦提\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130901, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"喀什\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130902, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"英吉沙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130903, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"塔什库尔干\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130904, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"麦盖提\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130905, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"莎车\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130906, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"叶城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130907, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"泽普\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130908, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"巴楚\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130909, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"岳普湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130910, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"伽师\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130911, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"疏附\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101130912, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"喀什\", \n" +
            "            \"district\": \"疏勒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131001, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"伊宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131002, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"察布查尔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131003, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"尼勒克\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131004, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"伊宁县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131005, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"巩留\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131006, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"新源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131007, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"昭苏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131008, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"特克斯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131009, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"霍城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131010, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"霍尔果斯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131011, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"伊犁\", \n" +
            "            \"district\": \"奎屯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131101, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"塔城\", \n" +
            "            \"district\": \"塔城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131102, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"塔城\", \n" +
            "            \"district\": \"裕民\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131103, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"塔城\", \n" +
            "            \"district\": \"额敏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131104, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"塔城\", \n" +
            "            \"district\": \"和布克赛尔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131105, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"塔城\", \n" +
            "            \"district\": \"托里\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131106, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"塔城\", \n" +
            "            \"district\": \"乌苏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131107, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"塔城\", \n" +
            "            \"district\": \"沙湾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131201, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"哈密\", \n" +
            "            \"district\": \"哈密\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131203, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"哈密\", \n" +
            "            \"district\": \"巴里坤\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131204, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"哈密\", \n" +
            "            \"district\": \"伊吾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131301, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"和田\", \n" +
            "            \"district\": \"和田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131302, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"和田\", \n" +
            "            \"district\": \"皮山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131303, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"和田\", \n" +
            "            \"district\": \"策勒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131304, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"和田\", \n" +
            "            \"district\": \"墨玉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131305, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"和田\", \n" +
            "            \"district\": \"洛浦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131306, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"和田\", \n" +
            "            \"district\": \"民丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131307, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"和田\", \n" +
            "            \"district\": \"于田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131401, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿勒泰\", \n" +
            "            \"district\": \"阿勒泰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131402, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿勒泰\", \n" +
            "            \"district\": \"哈巴河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131405, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿勒泰\", \n" +
            "            \"district\": \"吉木乃\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131406, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿勒泰\", \n" +
            "            \"district\": \"布尔津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131407, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿勒泰\", \n" +
            "            \"district\": \"福海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131408, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿勒泰\", \n" +
            "            \"district\": \"富蕴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131409, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"阿勒泰\", \n" +
            "            \"district\": \"青河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131501, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"克州\", \n" +
            "            \"district\": \"阿图什\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131502, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"克州\", \n" +
            "            \"district\": \"乌恰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131503, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"克州\", \n" +
            "            \"district\": \"阿克陶\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131504, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"克州\", \n" +
            "            \"district\": \"阿合奇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131601, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"博尔塔拉\", \n" +
            "            \"district\": \"博乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131602, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"博尔塔拉\", \n" +
            "            \"district\": \"温泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131603, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"博尔塔拉\", \n" +
            "            \"district\": \"精河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101131606, \n" +
            "            \"prov\": \"新疆\", \n" +
            "            \"city\": \"博尔塔拉\", \n" +
            "            \"district\": \"阿拉山口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140101, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"拉萨\", \n" +
            "            \"district\": \"拉萨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140102, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"拉萨\", \n" +
            "            \"district\": \"当雄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140103, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"拉萨\", \n" +
            "            \"district\": \"尼木\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140104, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"拉萨\", \n" +
            "            \"district\": \"林周\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140105, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"拉萨\", \n" +
            "            \"district\": \"堆龙德庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140106, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"拉萨\", \n" +
            "            \"district\": \"曲水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140107, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"拉萨\", \n" +
            "            \"district\": \"达孜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140108, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"拉萨\", \n" +
            "            \"district\": \"墨竹工卡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140201, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"日喀则\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140202, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"拉孜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140203, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"南木林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140204, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"聂拉木\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140205, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"定日\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140206, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"江孜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140207, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"帕里\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140208, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"仲巴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140209, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"萨嘎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140210, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"吉隆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140211, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"昂仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140212, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"定结\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140213, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"萨迦\"\n" +
            "        }, ";
    private final static String S4="\n" +
            "        {\n" +
            "            \"areaid\": 101140214, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"谢通门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140216, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"岗巴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140217, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"白朗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140218, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"亚东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140219, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"康马\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140220, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"日喀则\", \n" +
            "            \"district\": \"仁布\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140301, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"山南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140302, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"贡嘎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140303, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"札囊\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140304, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"加查\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140305, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"浪卡子\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140306, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"错那\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140307, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"隆子\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140308, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"泽当\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140309, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"乃东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140310, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"桑日\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140311, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"洛扎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140312, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"措美\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140313, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"琼结\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140314, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"山南\", \n" +
            "            \"district\": \"曲松\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140401, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"林芝\", \n" +
            "            \"district\": \"林芝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140402, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"林芝\", \n" +
            "            \"district\": \"波密\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140403, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"林芝\", \n" +
            "            \"district\": \"米林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140404, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"林芝\", \n" +
            "            \"district\": \"察隅\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140405, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"林芝\", \n" +
            "            \"district\": \"工布江达\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140406, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"林芝\", \n" +
            "            \"district\": \"朗县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140407, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"林芝\", \n" +
            "            \"district\": \"墨脱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140501, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"昌都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140502, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"丁青\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140503, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"边坝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140504, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"洛隆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140505, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"左贡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140506, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"芒康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140507, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"类乌齐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140508, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"八宿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140509, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"江达\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140510, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"察雅\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140511, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"昌都\", \n" +
            "            \"district\": \"贡觉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140601, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"那曲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140602, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"尼玛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140603, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"嘉黎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140604, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"班戈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140605, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"安多\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140606, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"索县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140607, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"聂荣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140608, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"巴青\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140609, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"比如\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140610, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"那曲\", \n" +
            "            \"district\": \"双湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140701, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"阿里\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140702, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"改则\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140703, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"申扎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140704, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"狮泉河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140705, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"普兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140706, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"札达\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140707, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"噶尔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140708, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"日土\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140709, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"革吉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101140710, \n" +
            "            \"prov\": \"西藏\", \n" +
            "            \"city\": \"阿里\", \n" +
            "            \"district\": \"措勤\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150101, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"西宁\", \n" +
            "            \"district\": \"西宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150102, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"西宁\", \n" +
            "            \"district\": \"大通\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150103, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"西宁\", \n" +
            "            \"district\": \"湟源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150104, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"西宁\", \n" +
            "            \"district\": \"湟中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150201, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海东\", \n" +
            "            \"district\": \"海东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150202, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海东\", \n" +
            "            \"district\": \"乐都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150203, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海东\", \n" +
            "            \"district\": \"民和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150204, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海东\", \n" +
            "            \"district\": \"互助\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150205, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海东\", \n" +
            "            \"district\": \"化隆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150206, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海东\", \n" +
            "            \"district\": \"循化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150207, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海东\", \n" +
            "            \"district\": \"冷湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150208, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海东\", \n" +
            "            \"district\": \"平安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150301, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"黄南\", \n" +
            "            \"district\": \"黄南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150302, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"黄南\", \n" +
            "            \"district\": \"尖扎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150303, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"黄南\", \n" +
            "            \"district\": \"泽库\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150304, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"黄南\", \n" +
            "            \"district\": \"河南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150305, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"黄南\", \n" +
            "            \"district\": \"同仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150401, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海南\", \n" +
            "            \"district\": \"海南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150404, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海南\", \n" +
            "            \"district\": \"贵德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150406, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海南\", \n" +
            "            \"district\": \"兴海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150407, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海南\", \n" +
            "            \"district\": \"贵南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150408, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海南\", \n" +
            "            \"district\": \"同德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150409, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海南\", \n" +
            "            \"district\": \"共和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150501, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"果洛\", \n" +
            "            \"district\": \"果洛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150502, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"果洛\", \n" +
            "            \"district\": \"班玛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150503, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"果洛\", \n" +
            "            \"district\": \"甘德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150504, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"果洛\", \n" +
            "            \"district\": \"达日\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150505, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"果洛\", \n" +
            "            \"district\": \"久治\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150506, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"果洛\", \n" +
            "            \"district\": \"玛多\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150508, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"果洛\", \n" +
            "            \"district\": \"玛沁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150601, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"玉树\", \n" +
            "            \"district\": \"玉树\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150602, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"玉树\", \n" +
            "            \"district\": \"称多\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150603, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"玉树\", \n" +
            "            \"district\": \"治多\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150604, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"玉树\", \n" +
            "            \"district\": \"杂多\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150605, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"玉树\", \n" +
            "            \"district\": \"囊谦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150606, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"玉树\", \n" +
            "            \"district\": \"曲麻莱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150701, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海西\", \n" +
            "            \"district\": \"海西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150708, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海西\", \n" +
            "            \"district\": \"天峻\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150709, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海西\", \n" +
            "            \"district\": \"乌兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150712, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海西\", \n" +
            "            \"district\": \"茫崖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150713, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海西\", \n" +
            "            \"district\": \"大柴旦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150716, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海西\", \n" +
            "            \"district\": \"德令哈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150801, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海北\", \n" +
            "            \"district\": \"海北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150802, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海北\", \n" +
            "            \"district\": \"门源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150803, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海北\", \n" +
            "            \"district\": \"祁连\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150804, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海北\", \n" +
            "            \"district\": \"海晏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150806, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"海北\", \n" +
            "            \"district\": \"刚察\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150901, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"格尔木\", \n" +
            "            \"district\": \"格尔木\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101150902, \n" +
            "            \"prov\": \"青海\", \n" +
            "            \"city\": \"格尔木\", \n" +
            "            \"district\": \"都兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160101, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"兰州\", \n" +
            "            \"district\": \"兰州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160102, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"兰州\", \n" +
            "            \"district\": \"皋兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160103, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"兰州\", \n" +
            "            \"district\": \"永登\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160104, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"兰州\", \n" +
            "            \"district\": \"榆中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160201, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"定西\", \n" +
            "            \"district\": \"定西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160202, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"定西\", \n" +
            "            \"district\": \"通渭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160203, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"定西\", \n" +
            "            \"district\": \"陇西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160204, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"定西\", \n" +
            "            \"district\": \"渭源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160205, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"定西\", \n" +
            "            \"district\": \"临洮\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160206, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"定西\", \n" +
            "            \"district\": \"漳县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160207, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"定西\", \n" +
            "            \"district\": \"岷县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160208, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"定西\", \n" +
            "            \"district\": \"安定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160301, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"平凉\", \n" +
            "            \"district\": \"平凉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160302, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"平凉\", \n" +
            "            \"district\": \"泾川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160303, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"平凉\", \n" +
            "            \"district\": \"灵台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160304, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"平凉\", \n" +
            "            \"district\": \"崇信\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160305, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"平凉\", \n" +
            "            \"district\": \"华亭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160306, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"平凉\", \n" +
            "            \"district\": \"庄浪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160307, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"平凉\", \n" +
            "            \"district\": \"静宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160308, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"平凉\", \n" +
            "            \"district\": \"崆峒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160401, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"庆阳\", \n" +
            "            \"district\": \"庆阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160403, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"庆阳\", \n" +
            "            \"district\": \"环县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160404, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"庆阳\", \n" +
            "            \"district\": \"华池\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160405, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"庆阳\", \n" +
            "            \"district\": \"合水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160406, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"庆阳\", \n" +
            "            \"district\": \"正宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160407, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"庆阳\", \n" +
            "            \"district\": \"宁县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160408, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"庆阳\", \n" +
            "            \"district\": \"镇原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160409, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"庆阳\", \n" +
            "            \"district\": \"庆城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160501, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"武威\", \n" +
            "            \"district\": \"武威\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160502, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"武威\", \n" +
            "            \"district\": \"民勤\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160503, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"武威\", \n" +
            "            \"district\": \"古浪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160505, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"武威\", \n" +
            "            \"district\": \"天祝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160601, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"金昌\", \n" +
            "            \"district\": \"金昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160602, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"金昌\", \n" +
            "            \"district\": \"永昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160701, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"张掖\", \n" +
            "            \"district\": \"张掖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160702, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"张掖\", \n" +
            "            \"district\": \"肃南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160703, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"张掖\", \n" +
            "            \"district\": \"民乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160704, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"张掖\", \n" +
            "            \"district\": \"临泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160705, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"张掖\", \n" +
            "            \"district\": \"高台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160706, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"张掖\", \n" +
            "            \"district\": \"山丹\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160801, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"酒泉\", \n" +
            "            \"district\": \"酒泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160803, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"酒泉\", \n" +
            "            \"district\": \"金塔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160804, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"酒泉\", \n" +
            "            \"district\": \"阿克塞\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160805, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"酒泉\", \n" +
            "            \"district\": \"瓜州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160806, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"酒泉\", \n" +
            "            \"district\": \"肃北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160807, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"酒泉\", \n" +
            "            \"district\": \"玉门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160808, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"酒泉\", \n" +
            "            \"district\": \"敦煌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160901, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"天水\", \n" +
            "            \"district\": \"天水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160903, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"天水\", \n" +
            "            \"district\": \"清水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160904, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"天水\", \n" +
            "            \"district\": \"秦安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160905, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"天水\", \n" +
            "            \"district\": \"甘谷\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160906, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"天水\", \n" +
            "            \"district\": \"武山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160907, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"天水\", \n" +
            "            \"district\": \"张家川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101160908, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"天水\", \n" +
            "            \"district\": \"麦积\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161001, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"武都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161002, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"成县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161003, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"文县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161004, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"宕昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161005, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"康县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161006, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"西和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161007, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"礼县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161008, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"徽县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161009, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"陇南\", \n" +
            "            \"district\": \"两当\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161101, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"临夏\", \n" +
            "            \"district\": \"临夏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161102, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"临夏\", \n" +
            "            \"district\": \"康乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161103, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"临夏\", \n" +
            "            \"district\": \"永靖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161104, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"临夏\", \n" +
            "            \"district\": \"广河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161105, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"临夏\", \n" +
            "            \"district\": \"和政\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161106, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"临夏\", \n" +
            "            \"district\": \"东乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161107, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"临夏\", \n" +
            "            \"district\": \"积石山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161201, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"甘南\", \n" +
            "            \"district\": \"合作\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161202, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"甘南\", \n" +
            "            \"district\": \"临潭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161203, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"甘南\", \n" +
            "            \"district\": \"卓尼\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161204, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"甘南\", \n" +
            "            \"district\": \"舟曲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161205, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"甘南\", \n" +
            "            \"district\": \"迭部\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161206, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"甘南\", \n" +
            "            \"district\": \"玛曲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161207, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"甘南\", \n" +
            "            \"district\": \"碌曲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161208, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"甘南\", \n" +
            "            \"district\": \"夏河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161301, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"白银\", \n" +
            "            \"district\": \"白银\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161302, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"白银\", \n" +
            "            \"district\": \"靖远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161303, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"白银\", \n" +
            "            \"district\": \"会宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161304, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"白银\", \n" +
            "            \"district\": \"平川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161305, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"白银\", \n" +
            "            \"district\": \"景泰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101161401, \n" +
            "            \"prov\": \"甘肃\", \n" +
            "            \"city\": \"嘉峪关\", \n" +
            "            \"district\": \"嘉峪关\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170101, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"银川\", \n" +
            "            \"district\": \"银川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170102, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"银川\", \n" +
            "            \"district\": \"永宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170103, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"银川\", \n" +
            "            \"district\": \"灵武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170104, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"银川\", \n" +
            "            \"district\": \"贺兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170201, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"石嘴山\", \n" +
            "            \"district\": \"石嘴山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170202, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"石嘴山\", \n" +
            "            \"district\": \"惠农\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170203, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"石嘴山\", \n" +
            "            \"district\": \"平罗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170204, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"石嘴山\", \n" +
            "            \"district\": \"陶乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170301, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"吴忠\", \n" +
            "            \"district\": \"吴忠\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170302, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"吴忠\", \n" +
            "            \"district\": \"同心\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170303, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"吴忠\", \n" +
            "            \"district\": \"盐池\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170306, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"吴忠\", \n" +
            "            \"district\": \"青铜峡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170401, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"固原\", \n" +
            "            \"district\": \"固原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170402, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"固原\", \n" +
            "            \"district\": \"西吉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170403, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"固原\", \n" +
            "            \"district\": \"隆德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170404, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"固原\", \n" +
            "            \"district\": \"泾源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170406, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"固原\", \n" +
            "            \"district\": \"彭阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170501, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"中卫\", \n" +
            "            \"district\": \"中卫\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170502, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"中卫\", \n" +
            "            \"district\": \"中宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101170504, \n" +
            "            \"prov\": \"宁夏\", \n" +
            "            \"city\": \"中卫\", \n" +
            "            \"district\": \"海原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180101, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"郑州\", \n" +
            "            \"district\": \"郑州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180102, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"郑州\", \n" +
            "            \"district\": \"巩义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180103, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"郑州\", \n" +
            "            \"district\": \"荥阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180104, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"郑州\", \n" +
            "            \"district\": \"登封\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180105, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"郑州\", \n" +
            "            \"district\": \"新密\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180106, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"郑州\", \n" +
            "            \"district\": \"新郑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180107, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"郑州\", \n" +
            "            \"district\": \"中牟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180108, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"郑州\", \n" +
            "            \"district\": \"上街\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180201, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"安阳\", \n" +
            "            \"district\": \"安阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180202, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"安阳\", \n" +
            "            \"district\": \"汤阴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180203, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"安阳\", \n" +
            "            \"district\": \"滑县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180204, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"安阳\", \n" +
            "            \"district\": \"内黄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180205, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"安阳\", \n" +
            "            \"district\": \"林州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180301, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"新乡\", \n" +
            "            \"district\": \"新乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180302, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"新乡\", \n" +
            "            \"district\": \"获嘉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180303, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"新乡\", \n" +
            "            \"district\": \"原阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180304, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"新乡\", \n" +
            "            \"district\": \"辉县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180305, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"新乡\", \n" +
            "            \"district\": \"卫辉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180306, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"新乡\", \n" +
            "            \"district\": \"延津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180307, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"新乡\", \n" +
            "            \"district\": \"封丘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180308, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"新乡\", \n" +
            "            \"district\": \"长垣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180401, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"许昌\", \n" +
            "            \"district\": \"许昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180402, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"许昌\", \n" +
            "            \"district\": \"鄢陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180403, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"许昌\", \n" +
            "            \"district\": \"襄城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180404, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"许昌\", \n" +
            "            \"district\": \"长葛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180405, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"许昌\", \n" +
            "            \"district\": \"禹州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180501, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"平顶山\", \n" +
            "            \"district\": \"平顶山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180502, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"平顶山\", \n" +
            "            \"district\": \"郏县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180503, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"平顶山\", \n" +
            "            \"district\": \"宝丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180504, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"平顶山\", \n" +
            "            \"district\": \"汝州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180505, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"平顶山\", \n" +
            "            \"district\": \"叶县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180506, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"平顶山\", \n" +
            "            \"district\": \"舞钢\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180507, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"平顶山\", \n" +
            "            \"district\": \"鲁山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180508, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"平顶山\", \n" +
            "            \"district\": \"石龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180601, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"信阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180602, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"息县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180603, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"罗山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180604, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"光山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180605, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"新县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180606, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"淮滨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180607, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"潢川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180608, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"固始\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180609, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"信阳\", \n" +
            "            \"district\": \"商城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180701, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"南阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180702, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"南召\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180703, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"方城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180704, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"社旗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180705, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"西峡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180706, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"内乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180707, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"镇平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180708, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"淅川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180709, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"新野\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180710, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"唐河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180711, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"邓州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180712, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"南阳\", \n" +
            "            \"district\": \"桐柏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180801, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"开封\", \n" +
            "            \"district\": \"开封\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180802, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"开封\", \n" +
            "            \"district\": \"杞县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180803, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"开封\", \n" +
            "            \"district\": \"尉氏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180804, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"开封\", \n" +
            "            \"district\": \"通许\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180805, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"开封\", \n" +
            "            \"district\": \"兰考\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180901, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"洛阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180902, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"新安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180903, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"孟津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180904, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"宜阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180905, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"洛宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180906, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"伊川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180907, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"嵩县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180908, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"偃师\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180909, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"栾川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180910, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"汝阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101180911, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"洛阳\", \n" +
            "            \"district\": \"吉利\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181001, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"商丘\", \n" +
            "            \"district\": \"商丘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181003, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"商丘\", \n" +
            "            \"district\": \"睢县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181004, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"商丘\", \n" +
            "            \"district\": \"民权\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181005, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"商丘\", \n" +
            "            \"district\": \"虞城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181006, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"商丘\", \n" +
            "            \"district\": \"柘城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181007, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"商丘\", \n" +
            "            \"district\": \"宁陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181008, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"商丘\", \n" +
            "            \"district\": \"夏邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181009, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"商丘\", \n" +
            "            \"district\": \"永城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181101, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"焦作\", \n" +
            "            \"district\": \"焦作\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181102, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"焦作\", \n" +
            "            \"district\": \"修武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181103, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"焦作\", \n" +
            "            \"district\": \"武陟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181104, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"焦作\", \n" +
            "            \"district\": \"沁阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181106, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"焦作\", \n" +
            "            \"district\": \"博爱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181107, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"焦作\", \n" +
            "            \"district\": \"温县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181108, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"焦作\", \n" +
            "            \"district\": \"孟州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181201, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"鹤壁\", \n" +
            "            \"district\": \"鹤壁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181202, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"鹤壁\", \n" +
            "            \"district\": \"浚县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181203, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"鹤壁\", \n" +
            "            \"district\": \"淇县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181301, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"濮阳\", \n" +
            "            \"district\": \"濮阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181302, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"濮阳\", \n" +
            "            \"district\": \"台前\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181303, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"濮阳\", \n" +
            "            \"district\": \"南乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181304, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"濮阳\", \n" +
            "            \"district\": \"清丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181305, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"濮阳\", \n" +
            "            \"district\": \"范县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181401, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"周口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181402, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"扶沟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181403, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"太康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181404, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"淮阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181405, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"西华\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181406, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"商水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181407, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"项城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181408, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"郸城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181409, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"鹿邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181410, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"周口\", \n" +
            "            \"district\": \"沈丘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181501, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"漯河\", \n" +
            "            \"district\": \"漯河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181502, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"漯河\", \n" +
            "            \"district\": \"临颍\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181503, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"漯河\", \n" +
            "            \"district\": \"舞阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181601, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"驻马店\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181602, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"西平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181603, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"遂平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181604, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"上蔡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181605, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"汝南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181606, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"泌阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181607, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"平舆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181608, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"新蔡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181609, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"确山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181610, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"驻马店\", \n" +
            "            \"district\": \"正阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181701, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"三门峡\", \n" +
            "            \"district\": \"三门峡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181702, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"三门峡\", \n" +
            "            \"district\": \"灵宝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181703, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"三门峡\", \n" +
            "            \"district\": \"渑池\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181704, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"三门峡\", \n" +
            "            \"district\": \"卢氏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181705, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"三门峡\", \n" +
            "            \"district\": \"义马\"\n" +
            "        }, ";
    private  final static String S5="{\n" +
            "            \"areaid\": 101181706, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"三门峡\", \n" +
            "            \"district\": \"陕县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101181801, \n" +
            "            \"prov\": \"河南\", \n" +
            "            \"city\": \"济源\", \n" +
            "            \"district\": \"济源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190101, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南京\", \n" +
            "            \"district\": \"南京\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190102, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南京\", \n" +
            "            \"district\": \"溧水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190103, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南京\", \n" +
            "            \"district\": \"高淳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190104, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南京\", \n" +
            "            \"district\": \"江宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190105, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南京\", \n" +
            "            \"district\": \"六合\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190106, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南京\", \n" +
            "            \"district\": \"江浦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190107, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南京\", \n" +
            "            \"district\": \"浦口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190201, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"无锡\", \n" +
            "            \"district\": \"无锡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190202, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"无锡\", \n" +
            "            \"district\": \"江阴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190203, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"无锡\", \n" +
            "            \"district\": \"宜兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190204, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"无锡\", \n" +
            "            \"district\": \"锡山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190301, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"镇江\", \n" +
            "            \"district\": \"镇江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190302, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"镇江\", \n" +
            "            \"district\": \"丹阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190303, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"镇江\", \n" +
            "            \"district\": \"扬中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190304, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"镇江\", \n" +
            "            \"district\": \"句容\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190305, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"镇江\", \n" +
            "            \"district\": \"丹徒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190401, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"苏州\", \n" +
            "            \"district\": \"苏州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190402, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"苏州\", \n" +
            "            \"district\": \"常熟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190403, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"苏州\", \n" +
            "            \"district\": \"张家港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190404, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"苏州\", \n" +
            "            \"district\": \"昆山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190405, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"苏州\", \n" +
            "            \"district\": \"吴中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190407, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"苏州\", \n" +
            "            \"district\": \"吴江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190408, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"苏州\", \n" +
            "            \"district\": \"太仓\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190501, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南通\", \n" +
            "            \"district\": \"南通\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190502, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南通\", \n" +
            "            \"district\": \"海安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190503, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南通\", \n" +
            "            \"district\": \"如皋\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190504, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南通\", \n" +
            "            \"district\": \"如东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190507, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南通\", \n" +
            "            \"district\": \"启东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190508, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南通\", \n" +
            "            \"district\": \"海门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190509, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"南通\", \n" +
            "            \"district\": \"通州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190601, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"扬州\", \n" +
            "            \"district\": \"扬州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190602, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"扬州\", \n" +
            "            \"district\": \"宝应\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190603, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"扬州\", \n" +
            "            \"district\": \"仪征\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190604, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"扬州\", \n" +
            "            \"district\": \"高邮\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190605, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"扬州\", \n" +
            "            \"district\": \"江都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190606, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"扬州\", \n" +
            "            \"district\": \"邗江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190701, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"盐城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190702, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"响水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190703, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"滨海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190704, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"阜宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190705, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"射阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190706, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"建湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190707, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"东台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190708, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"大丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190709, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"盐城\", \n" +
            "            \"district\": \"盐都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190801, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"徐州\", \n" +
            "            \"district\": \"徐州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190802, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"徐州\", \n" +
            "            \"district\": \"铜山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190803, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"徐州\", \n" +
            "            \"district\": \"丰县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190804, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"徐州\", \n" +
            "            \"district\": \"沛县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190805, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"徐州\", \n" +
            "            \"district\": \"邳州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190806, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"徐州\", \n" +
            "            \"district\": \"睢宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190807, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"徐州\", \n" +
            "            \"district\": \"新沂\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190901, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"淮安\", \n" +
            "            \"district\": \"淮安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190902, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"淮安\", \n" +
            "            \"district\": \"金湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190903, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"淮安\", \n" +
            "            \"district\": \"盱眙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190904, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"淮安\", \n" +
            "            \"district\": \"洪泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190905, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"淮安\", \n" +
            "            \"district\": \"涟水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190906, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"淮安\", \n" +
            "            \"district\": \"淮阴区\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101190908, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"淮安\", \n" +
            "            \"district\": \"淮安区\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191001, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"连云港\", \n" +
            "            \"district\": \"连云港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191002, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"连云港\", \n" +
            "            \"district\": \"东海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191003, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"连云港\", \n" +
            "            \"district\": \"赣榆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191004, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"连云港\", \n" +
            "            \"district\": \"灌云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191005, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"连云港\", \n" +
            "            \"district\": \"灌南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191101, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"常州\", \n" +
            "            \"district\": \"常州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191102, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"常州\", \n" +
            "            \"district\": \"溧阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191103, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"常州\", \n" +
            "            \"district\": \"金坛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191104, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"常州\", \n" +
            "            \"district\": \"武进\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191201, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"泰州\", \n" +
            "            \"district\": \"泰州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191202, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"泰州\", \n" +
            "            \"district\": \"兴化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191203, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"泰州\", \n" +
            "            \"district\": \"泰兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191204, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"泰州\", \n" +
            "            \"district\": \"姜堰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191205, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"泰州\", \n" +
            "            \"district\": \"靖江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191301, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"宿迁\", \n" +
            "            \"district\": \"宿迁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191302, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"宿迁\", \n" +
            "            \"district\": \"沭阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191303, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"宿迁\", \n" +
            "            \"district\": \"泗阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191304, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"宿迁\", \n" +
            "            \"district\": \"泗洪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101191305, \n" +
            "            \"prov\": \"江苏\", \n" +
            "            \"city\": \"宿迁\", \n" +
            "            \"district\": \"宿豫\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200101, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"武汉\", \n" +
            "            \"district\": \"武汉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200102, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"武汉\", \n" +
            "            \"district\": \"蔡甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200103, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"武汉\", \n" +
            "            \"district\": \"黄陂\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200104, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"武汉\", \n" +
            "            \"district\": \"新洲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200105, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"武汉\", \n" +
            "            \"district\": \"江夏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200106, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"武汉\", \n" +
            "            \"district\": \"东西湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200201, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"襄阳\", \n" +
            "            \"district\": \"襄阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200202, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"襄阳\", \n" +
            "            \"district\": \"襄州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200203, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"襄阳\", \n" +
            "            \"district\": \"保康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200204, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"襄阳\", \n" +
            "            \"district\": \"南漳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200205, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"襄阳\", \n" +
            "            \"district\": \"宜城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200206, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"襄阳\", \n" +
            "            \"district\": \"老河口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200207, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"襄阳\", \n" +
            "            \"district\": \"谷城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200208, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"襄阳\", \n" +
            "            \"district\": \"枣阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200301, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"鄂州\", \n" +
            "            \"district\": \"鄂州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200302, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"鄂州\", \n" +
            "            \"district\": \"梁子湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200401, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"孝感\", \n" +
            "            \"district\": \"孝感\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200402, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"孝感\", \n" +
            "            \"district\": \"安陆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200403, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"孝感\", \n" +
            "            \"district\": \"云梦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200404, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"孝感\", \n" +
            "            \"district\": \"大悟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200405, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"孝感\", \n" +
            "            \"district\": \"应城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200406, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"孝感\", \n" +
            "            \"district\": \"汉川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200407, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"孝感\", \n" +
            "            \"district\": \"孝昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200501, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"黄冈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200502, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"红安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200503, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"麻城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200504, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"罗田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200505, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"英山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200506, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"浠水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200507, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"蕲春\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200508, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"黄梅\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200509, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"武穴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200510, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄冈\", \n" +
            "            \"district\": \"团风\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200601, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄石\", \n" +
            "            \"district\": \"黄石\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200602, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄石\", \n" +
            "            \"district\": \"大冶\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200603, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄石\", \n" +
            "            \"district\": \"阳新\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200604, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄石\", \n" +
            "            \"district\": \"铁山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200605, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄石\", \n" +
            "            \"district\": \"下陆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200606, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"黄石\", \n" +
            "            \"district\": \"西塞山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200701, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"咸宁\", \n" +
            "            \"district\": \"咸宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200702, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"咸宁\", \n" +
            "            \"district\": \"赤壁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200703, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"咸宁\", \n" +
            "            \"district\": \"嘉鱼\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200704, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"咸宁\", \n" +
            "            \"district\": \"崇阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200705, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"咸宁\", \n" +
            "            \"district\": \"通城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200706, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"咸宁\", \n" +
            "            \"district\": \"通山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200801, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆州\", \n" +
            "            \"district\": \"荆州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200802, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆州\", \n" +
            "            \"district\": \"江陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200803, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆州\", \n" +
            "            \"district\": \"公安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200804, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆州\", \n" +
            "            \"district\": \"石首\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200805, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆州\", \n" +
            "            \"district\": \"监利\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200806, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆州\", \n" +
            "            \"district\": \"洪湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200807, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆州\", \n" +
            "            \"district\": \"松滋\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200901, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"宜昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200902, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"远安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200903, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"秭归\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200904, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"兴山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200906, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"五峰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200907, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"当阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200908, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"长阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200909, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"宜都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200910, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"枝江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200911, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"三峡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101200912, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"宜昌\", \n" +
            "            \"district\": \"夷陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201001, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"恩施\", \n" +
            "            \"district\": \"恩施\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201002, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"恩施\", \n" +
            "            \"district\": \"利川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201003, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"恩施\", \n" +
            "            \"district\": \"建始\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201004, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"恩施\", \n" +
            "            \"district\": \"咸丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201005, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"恩施\", \n" +
            "            \"district\": \"宣恩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201006, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"恩施\", \n" +
            "            \"district\": \"鹤峰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201007, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"恩施\", \n" +
            "            \"district\": \"来凤\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201008, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"恩施\", \n" +
            "            \"district\": \"巴东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201101, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"十堰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201102, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"竹溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201103, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"郧西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201104, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"郧县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201105, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"竹山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201106, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"房县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201107, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"丹江口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201108, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"茅箭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201109, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"十堰\", \n" +
            "            \"district\": \"张湾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201201, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"神农架\", \n" +
            "            \"district\": \"神农架\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201301, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"随州\", \n" +
            "            \"district\": \"随州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201302, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"随州\", \n" +
            "            \"district\": \"广水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201401, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆门\", \n" +
            "            \"district\": \"荆门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201402, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆门\", \n" +
            "            \"district\": \"钟祥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201403, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆门\", \n" +
            "            \"district\": \"京山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201404, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆门\", \n" +
            "            \"district\": \"掇刀\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201405, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆门\", \n" +
            "            \"district\": \"沙洋\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201406, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"荆州\", \n" +
            "            \"district\": \"沙市\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201501, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"天门\", \n" +
            "            \"district\": \"天门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201601, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"仙桃\", \n" +
            "            \"district\": \"仙桃\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101201701, \n" +
            "            \"prov\": \"湖北\", \n" +
            "            \"city\": \"潜江\", \n" +
            "            \"district\": \"潜江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210101, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"杭州\", \n" +
            "            \"district\": \"杭州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210102, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"杭州\", \n" +
            "            \"district\": \"萧山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210103, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"杭州\", \n" +
            "            \"district\": \"桐庐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210104, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"杭州\", \n" +
            "            \"district\": \"淳安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210105, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"杭州\", \n" +
            "            \"district\": \"建德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210106, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"杭州\", \n" +
            "            \"district\": \"余杭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210107, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"杭州\", \n" +
            "            \"district\": \"临安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210108, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"杭州\", \n" +
            "            \"district\": \"富阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210201, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"湖州\", \n" +
            "            \"district\": \"湖州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210202, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"湖州\", \n" +
            "            \"district\": \"长兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210203, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"湖州\", \n" +
            "            \"district\": \"安吉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210204, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"湖州\", \n" +
            "            \"district\": \"德清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210301, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"嘉兴\", \n" +
            "            \"district\": \"嘉兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210302, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"嘉兴\", \n" +
            "            \"district\": \"嘉善\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210303, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"嘉兴\", \n" +
            "            \"district\": \"海宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210304, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"嘉兴\", \n" +
            "            \"district\": \"桐乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210305, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"嘉兴\", \n" +
            "            \"district\": \"平湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210306, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"嘉兴\", \n" +
            "            \"district\": \"海盐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210401, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"宁波\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210403, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"慈溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210404, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"余姚\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210405, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"奉化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210406, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"象山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210408, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"宁海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210410, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"北仑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210411, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"鄞州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210412, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"宁波\", \n" +
            "            \"district\": \"镇海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210501, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"绍兴\", \n" +
            "            \"district\": \"绍兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210502, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"绍兴\", \n" +
            "            \"district\": \"诸暨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210503, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"绍兴\", \n" +
            "            \"district\": \"上虞\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210504, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"绍兴\", \n" +
            "            \"district\": \"新昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210505, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"绍兴\", \n" +
            "            \"district\": \"嵊州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210601, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"台州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210603, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"玉环\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210604, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"三门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210605, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"天台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210606, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"仙居\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210607, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"温岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210609, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"洪家\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210610, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"临海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210611, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"椒江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210612, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"黄岩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210613, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"台州\", \n" +
            "            \"district\": \"路桥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210701, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"温州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210702, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"泰顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210703, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"文成\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210704, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"平阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210705, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"瑞安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210706, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"洞头\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210707, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"乐清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210708, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"永嘉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210709, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"温州\", \n" +
            "            \"district\": \"苍南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210801, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"丽水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210802, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"遂昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210803, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"龙泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210804, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"缙云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210805, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"青田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210806, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"云和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210807, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"庆元\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210808, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"松阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210809, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"丽水\", \n" +
            "            \"district\": \"景宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210901, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"金华\", \n" +
            "            \"district\": \"金华\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210902, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"金华\", \n" +
            "            \"district\": \"浦江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210903, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"金华\", \n" +
            "            \"district\": \"兰溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210904, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"金华\", \n" +
            "            \"district\": \"义乌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210905, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"金华\", \n" +
            "            \"district\": \"东阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210906, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"金华\", \n" +
            "            \"district\": \"武义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210907, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"金华\", \n" +
            "            \"district\": \"永康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101210908, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"金华\", \n" +
            "            \"district\": \"磐安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211001, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"衢州\", \n" +
            "            \"district\": \"衢州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211002, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"衢州\", \n" +
            "            \"district\": \"常山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211003, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"衢州\", \n" +
            "            \"district\": \"开化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211004, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"衢州\", \n" +
            "            \"district\": \"龙游\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211005, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"衢州\", \n" +
            "            \"district\": \"江山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211006, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"衢州\", \n" +
            "            \"district\": \"衢江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211101, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"舟山\", \n" +
            "            \"district\": \"舟山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211102, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"舟山\", \n" +
            "            \"district\": \"嵊泗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211104, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"舟山\", \n" +
            "            \"district\": \"岱山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211105, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"舟山\", \n" +
            "            \"district\": \"普陀\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101211106, \n" +
            "            \"prov\": \"浙江\", \n" +
            "            \"city\": \"舟山\", \n" +
            "            \"district\": \"定海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220101, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"合肥\", \n" +
            "            \"district\": \"合肥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220102, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"合肥\", \n" +
            "            \"district\": \"长丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220103, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"合肥\", \n" +
            "            \"district\": \"肥东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220104, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"合肥\", \n" +
            "            \"district\": \"肥西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220105, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"合肥\", \n" +
            "            \"district\": \"巢湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220106, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"合肥\", \n" +
            "            \"district\": \"庐江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220201, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"蚌埠\", \n" +
            "            \"district\": \"蚌埠\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220202, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"蚌埠\", \n" +
            "            \"district\": \"怀远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220203, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"蚌埠\", \n" +
            "            \"district\": \"固镇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220204, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"蚌埠\", \n" +
            "            \"district\": \"五河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220301, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"芜湖\", \n" +
            "            \"district\": \"芜湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220302, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"芜湖\", \n" +
            "            \"district\": \"繁昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220303, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"芜湖\", \n" +
            "            \"district\": \"芜湖县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220304, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"芜湖\", \n" +
            "            \"district\": \"南陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220305, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"芜湖\", \n" +
            "            \"district\": \"无为\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220401, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"淮南\", \n" +
            "            \"district\": \"淮南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220402, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"淮南\", \n" +
            "            \"district\": \"凤台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220403, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"淮南\", \n" +
            "            \"district\": \"潘集\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220501, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"马鞍山\", \n" +
            "            \"district\": \"马鞍山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220502, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"马鞍山\", \n" +
            "            \"district\": \"当涂\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220503, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"马鞍山\", \n" +
            "            \"district\": \"含山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220504, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"马鞍山\", \n" +
            "            \"district\": \"和县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220601, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"安庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220602, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"枞阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220603, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"太湖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220604, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"潜山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220605, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"怀宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220606, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"宿松\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220607, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"望江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220608, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"岳西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220609, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"安庆\", \n" +
            "            \"district\": \"桐城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220701, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宿州\", \n" +
            "            \"district\": \"宿州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220702, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宿州\", \n" +
            "            \"district\": \"砀山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220703, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宿州\", \n" +
            "            \"district\": \"灵璧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220704, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宿州\", \n" +
            "            \"district\": \"泗县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220705, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宿州\", \n" +
            "            \"district\": \"萧县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220801, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"阜阳\", \n" +
            "            \"district\": \"阜阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220802, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"阜阳\", \n" +
            "            \"district\": \"阜南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220803, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"阜阳\", \n" +
            "            \"district\": \"颍上\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220804, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"阜阳\", \n" +
            "            \"district\": \"临泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220805, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"阜阳\", \n" +
            "            \"district\": \"界首\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220806, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"阜阳\", \n" +
            "            \"district\": \"太和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220901, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"亳州\", \n" +
            "            \"district\": \"亳州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220902, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"亳州\", \n" +
            "            \"district\": \"涡阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220903, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"亳州\", \n" +
            "            \"district\": \"利辛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101220904, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"亳州\", \n" +
            "            \"district\": \"蒙城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221001, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"黄山\", \n" +
            "            \"district\": \"黄山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221002, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"黄山\", \n" +
            "            \"district\": \"黄山区\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221003, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"黄山\", \n" +
            "            \"district\": \"屯溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221004, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"黄山\", \n" +
            "            \"district\": \"祁门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221005, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"黄山\", \n" +
            "            \"district\": \"黟县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221006, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"黄山\", \n" +
            "            \"district\": \"歙县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221007, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"黄山\", \n" +
            "            \"district\": \"休宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221008, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"黄山\", \n" +
            "            \"district\": \"黄山风景区\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221101, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"滁州\", \n" +
            "            \"district\": \"滁州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221102, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"滁州\", \n" +
            "            \"district\": \"凤阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221103, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"滁州\", \n" +
            "            \"district\": \"明光\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221104, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"滁州\", \n" +
            "            \"district\": \"定远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221105, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"滁州\", \n" +
            "            \"district\": \"全椒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221106, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"滁州\", \n" +
            "            \"district\": \"来安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221107, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"滁州\", \n" +
            "            \"district\": \"天长\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221201, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"淮北\", \n" +
            "            \"district\": \"淮北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221202, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"淮北\", \n" +
            "            \"district\": \"濉溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221301, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"铜陵\", \n" +
            "            \"district\": \"铜陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221401, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宣城\", \n" +
            "            \"district\": \"宣城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221402, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宣城\", \n" +
            "            \"district\": \"泾县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221403, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宣城\", \n" +
            "            \"district\": \"旌德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221404, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宣城\", \n" +
            "            \"district\": \"宁国\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221405, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宣城\", \n" +
            "            \"district\": \"绩溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221406, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宣城\", \n" +
            "            \"district\": \"广德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221407, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"宣城\", \n" +
            "            \"district\": \"郎溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221501, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"六安\", \n" +
            "            \"district\": \"六安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221502, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"六安\", \n" +
            "            \"district\": \"霍邱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221503, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"六安\", \n" +
            "            \"district\": \"寿县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221505, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"六安\", \n" +
            "            \"district\": \"金寨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221506, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"六安\", \n" +
            "            \"district\": \"霍山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221507, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"六安\", \n" +
            "            \"district\": \"舒城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221701, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"池州\", \n" +
            "            \"district\": \"池州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221702, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"池州\", \n" +
            "            \"district\": \"东至\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221703, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"池州\", \n" +
            "            \"district\": \"青阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101221704, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"池州\", \n" +
            "            \"district\": \"九华山\"\n" +
            "        }, ";
    private final static String S6="{\n" +
            "            \"areaid\": 101221705, \n" +
            "            \"prov\": \"安徽\", \n" +
            "            \"city\": \"池州\", \n" +
            "            \"district\": \"石台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230101, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"福州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230102, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"闽清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230103, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"闽侯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230104, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"罗源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230105, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"连江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230107, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"永泰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230108, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"平潭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230110, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"长乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230111, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"福州\", \n" +
            "            \"district\": \"福清\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230201, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"厦门\", \n" +
            "            \"district\": \"厦门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230202, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"厦门\", \n" +
            "            \"district\": \"同安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230301, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"宁德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230302, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"古田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230303, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"霞浦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230304, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"寿宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230305, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"周宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230306, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"福安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230307, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"柘荣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230308, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"福鼎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230309, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"宁德\", \n" +
            "            \"district\": \"屏南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230401, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"莆田\", \n" +
            "            \"district\": \"莆田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230402, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"莆田\", \n" +
            "            \"district\": \"仙游\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230403, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"莆田\", \n" +
            "            \"district\": \"秀屿港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230404, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"莆田\", \n" +
            "            \"district\": \"涵江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230405, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"莆田\", \n" +
            "            \"district\": \"秀屿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230406, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"莆田\", \n" +
            "            \"district\": \"荔城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230407, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"莆田\", \n" +
            "            \"district\": \"城厢\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230501, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"泉州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230502, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"安溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230504, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"永春\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230505, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"德化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230506, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"南安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230507, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"崇武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230508, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"惠安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230509, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"晋江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230510, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"泉州\", \n" +
            "            \"district\": \"石狮\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230601, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"漳州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230602, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"长泰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230603, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"南靖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230604, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"平和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230605, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"龙海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230606, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"漳浦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230607, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"诏安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230608, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"东山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230609, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"云霄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230610, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"漳州\", \n" +
            "            \"district\": \"华安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230701, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"龙岩\", \n" +
            "            \"district\": \"龙岩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230702, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"龙岩\", \n" +
            "            \"district\": \"长汀\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230703, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"龙岩\", \n" +
            "            \"district\": \"连城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230704, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"龙岩\", \n" +
            "            \"district\": \"武平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230705, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"龙岩\", \n" +
            "            \"district\": \"上杭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230706, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"龙岩\", \n" +
            "            \"district\": \"永定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230707, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"龙岩\", \n" +
            "            \"district\": \"漳平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230801, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"三明\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230802, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"宁化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230803, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"清流\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230804, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"泰宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230805, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"将乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230806, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"建宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230807, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"明溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230808, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"沙县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230809, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"尤溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230810, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"永安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230811, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"三明\", \n" +
            "            \"district\": \"大田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230901, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"南平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230902, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"顺昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230903, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"光泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230904, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"邵武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230905, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"武夷山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230906, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"浦城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230907, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"建阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230908, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"松溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230909, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"政和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101230910, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"南平\", \n" +
            "            \"district\": \"建瓯\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101231001, \n" +
            "            \"prov\": \"福建\", \n" +
            "            \"city\": \"钓鱼岛\", \n" +
            "            \"district\": \"钓鱼岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240101, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"南昌\", \n" +
            "            \"district\": \"南昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240102, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"南昌\", \n" +
            "            \"district\": \"新建\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240103, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"南昌\", \n" +
            "            \"district\": \"南昌县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240104, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"南昌\", \n" +
            "            \"district\": \"安义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240105, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"南昌\", \n" +
            "            \"district\": \"进贤\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240201, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"九江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240202, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"瑞昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240203, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"庐山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240204, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"武宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240205, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"德安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240206, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"永修\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240207, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"湖口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240208, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"彭泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240209, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"星子\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240210, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"都昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240212, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"九江\", \n" +
            "            \"district\": \"修水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240301, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"上饶\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240302, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"鄱阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240303, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"婺源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240305, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"余干\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240306, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"万年\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240307, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"德兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240308, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"上饶县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240309, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"弋阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240310, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"横峰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240311, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"铅山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240312, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"玉山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240313, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"上饶\", \n" +
            "            \"district\": \"广丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240401, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"抚州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240402, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"广昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240403, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"乐安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240404, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"崇仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240405, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"金溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240406, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"资溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240407, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"宜黄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240408, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"南城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240409, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"南丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240410, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"黎川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240411, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"抚州\", \n" +
            "            \"district\": \"东乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240501, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"宜春\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240502, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"铜鼓\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240503, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"宜丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240504, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"万载\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240505, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"上高\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240506, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"靖安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240507, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"奉新\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240508, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"高安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240509, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"樟树\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240510, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"宜春\", \n" +
            "            \"district\": \"丰城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240601, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"吉安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240602, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"吉安县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240603, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"吉水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240604, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"新干\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240605, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"峡江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240606, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"永丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240607, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"永新\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240608, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"井冈山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240609, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"万安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240610, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"遂川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240611, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"泰和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240612, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"安福\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240613, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"吉安\", \n" +
            "            \"district\": \"宁冈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240701, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"赣州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240702, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"崇义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240703, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"上犹\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240704, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"南康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240705, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"大余\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240706, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"信丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240707, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"宁都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240708, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"石城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240709, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"瑞金\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240710, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"于都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240711, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"会昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240712, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"安远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240713, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"全南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240714, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"龙南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240715, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"定南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240716, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"寻乌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240717, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"兴国\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240718, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"赣州\", \n" +
            "            \"district\": \"赣县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240801, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"景德镇\", \n" +
            "            \"district\": \"景德镇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240802, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"景德镇\", \n" +
            "            \"district\": \"乐平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240803, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"景德镇\", \n" +
            "            \"district\": \"浮梁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240901, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"萍乡\", \n" +
            "            \"district\": \"萍乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240902, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"萍乡\", \n" +
            "            \"district\": \"莲花\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240903, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"萍乡\", \n" +
            "            \"district\": \"上栗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240904, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"萍乡\", \n" +
            "            \"district\": \"安源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240905, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"萍乡\", \n" +
            "            \"district\": \"芦溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101240906, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"萍乡\", \n" +
            "            \"district\": \"湘东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101241001, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"新余\", \n" +
            "            \"district\": \"新余\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101241002, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"新余\", \n" +
            "            \"district\": \"分宜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101241101, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"鹰潭\", \n" +
            "            \"district\": \"鹰潭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101241102, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"鹰潭\", \n" +
            "            \"district\": \"余江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101241103, \n" +
            "            \"prov\": \"江西\", \n" +
            "            \"city\": \"鹰潭\", \n" +
            "            \"district\": \"贵溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250101, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"长沙\", \n" +
            "            \"district\": \"长沙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250102, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"长沙\", \n" +
            "            \"district\": \"宁乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250103, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"长沙\", \n" +
            "            \"district\": \"浏阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250104, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"长沙\", \n" +
            "            \"district\": \"马坡岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250105, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"长沙\", \n" +
            "            \"district\": \"望城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250201, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘潭\", \n" +
            "            \"district\": \"湘潭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250202, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘潭\", \n" +
            "            \"district\": \"韶山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250203, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘潭\", \n" +
            "            \"district\": \"湘乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250301, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"株洲\", \n" +
            "            \"district\": \"株洲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250302, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"株洲\", \n" +
            "            \"district\": \"攸县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250303, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"株洲\", \n" +
            "            \"district\": \"醴陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250305, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"株洲\", \n" +
            "            \"district\": \"茶陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250306, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"株洲\", \n" +
            "            \"district\": \"炎陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250401, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"衡阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250402, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"衡山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250403, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"衡东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250404, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"祁东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250405, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"衡阳县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250406, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"常宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250407, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"衡南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250408, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"耒阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250409, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"衡阳\", \n" +
            "            \"district\": \"南岳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250501, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"郴州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250502, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"桂阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250503, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"嘉禾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250504, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"宜章\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250505, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"临武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250507, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"资兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250508, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"汝城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250509, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"安仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250510, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"永兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250511, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"桂东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250512, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"郴州\", \n" +
            "            \"district\": \"苏仙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250601, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"常德\", \n" +
            "            \"district\": \"常德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250602, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"常德\", \n" +
            "            \"district\": \"安乡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250603, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"常德\", \n" +
            "            \"district\": \"桃源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250604, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"常德\", \n" +
            "            \"district\": \"汉寿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250605, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"常德\", \n" +
            "            \"district\": \"澧县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250606, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"常德\", \n" +
            "            \"district\": \"临澧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250607, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"常德\", \n" +
            "            \"district\": \"石门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250608, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"常德\", \n" +
            "            \"district\": \"津市\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250700, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"益阳\", \n" +
            "            \"district\": \"益阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250701, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"益阳\", \n" +
            "            \"district\": \"赫山区\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250702, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"益阳\", \n" +
            "            \"district\": \"南县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250703, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"益阳\", \n" +
            "            \"district\": \"桃江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250704, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"益阳\", \n" +
            "            \"district\": \"安化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250705, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"益阳\", \n" +
            "            \"district\": \"沅江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250801, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"娄底\", \n" +
            "            \"district\": \"娄底\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250802, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"娄底\", \n" +
            "            \"district\": \"双峰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250803, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"娄底\", \n" +
            "            \"district\": \"冷水江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250805, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"娄底\", \n" +
            "            \"district\": \"新化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250806, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"娄底\", \n" +
            "            \"district\": \"涟源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250901, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"邵阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250902, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"隆回\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250903, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"洞口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250904, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"新邵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250905, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"邵东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250906, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"绥宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250907, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"新宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250908, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"武冈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250909, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"城步\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101250910, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"邵阳\", \n" +
            "            \"district\": \"邵阳县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251001, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"岳阳\", \n" +
            "            \"district\": \"岳阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251002, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"岳阳\", \n" +
            "            \"district\": \"华容\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251003, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"岳阳\", \n" +
            "            \"district\": \"湘阴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251004, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"岳阳\", \n" +
            "            \"district\": \"汨罗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251005, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"岳阳\", \n" +
            "            \"district\": \"平江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251006, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"岳阳\", \n" +
            "            \"district\": \"临湘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251101, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"张家界\", \n" +
            "            \"district\": \"张家界\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251102, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"张家界\", \n" +
            "            \"district\": \"桑植\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251103, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"张家界\", \n" +
            "            \"district\": \"慈利\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251104, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"张家界\", \n" +
            "            \"district\": \"武陵源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251201, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"怀化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251203, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"沅陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251204, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"辰溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251205, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"靖州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251206, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"会同\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251207, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"通道\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251208, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"麻阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251209, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"新晃\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251210, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"芷江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251211, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"溆浦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251212, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"中方\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251213, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"怀化\", \n" +
            "            \"district\": \"洪江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251401, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"永州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251402, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"祁阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251403, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"东安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251404, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"双牌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251405, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"道县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251406, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"宁远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251407, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"江永\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251408, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"蓝山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251409, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"新田\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251410, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"江华\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251411, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"永州\", \n" +
            "            \"district\": \"冷水滩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251501, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘西\", \n" +
            "            \"district\": \"吉首\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251502, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘西\", \n" +
            "            \"district\": \"保靖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251503, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘西\", \n" +
            "            \"district\": \"永顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251504, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘西\", \n" +
            "            \"district\": \"古丈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251505, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘西\", \n" +
            "            \"district\": \"凤凰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251506, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘西\", \n" +
            "            \"district\": \"泸溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251507, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘西\", \n" +
            "            \"district\": \"龙山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101251508, \n" +
            "            \"prov\": \"湖南\", \n" +
            "            \"city\": \"湘西\", \n" +
            "            \"district\": \"花垣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260101, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"贵阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260102, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"白云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260103, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"花溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260104, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"乌当\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260105, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"息烽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260106, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"开阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260107, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"修文\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260108, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"清镇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260109, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"小河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260110, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"云岩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260111, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"贵阳\", \n" +
            "            \"district\": \"南明\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260201, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"遵义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260202, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"遵义县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260203, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"仁怀\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260204, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"绥阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260205, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"湄潭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260206, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"凤冈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260207, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"桐梓\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260208, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"赤水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260209, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"习水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260210, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"道真\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260211, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"正安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260212, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"务川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260213, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"余庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260214, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"汇川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260215, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"遵义\", \n" +
            "            \"district\": \"红花岗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260301, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"安顺\", \n" +
            "            \"district\": \"安顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260302, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"安顺\", \n" +
            "            \"district\": \"普定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260303, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"安顺\", \n" +
            "            \"district\": \"镇宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260304, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"安顺\", \n" +
            "            \"district\": \"平坝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260305, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"安顺\", \n" +
            "            \"district\": \"紫云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260306, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"安顺\", \n" +
            "            \"district\": \"关岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260401, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"都匀\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260402, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"贵定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260403, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"瓮安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260404, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"长顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260405, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"福泉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260406, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"惠水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260407, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"龙里\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260408, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"罗甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260409, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"平塘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260410, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"独山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260411, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"三都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260412, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔南\", \n" +
            "            \"district\": \"荔波\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260501, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"凯里\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260502, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"岑巩\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260503, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"施秉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260504, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"镇远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260505, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"黄平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260507, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"麻江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260508, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"丹寨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260509, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"三穗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260510, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"台江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260511, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"剑河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260512, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"雷山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260513, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"黎平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260514, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"天柱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260515, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"锦屏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260516, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"榕江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260517, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔东南\", \n" +
            "            \"district\": \"从江\"\n" +
            "        }, ";
    private final static String S7=" {\n" +
            "            \"areaid\": 101260601, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"铜仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260602, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"江口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260603, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"玉屏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260604, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"万山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260605, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"思南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260607, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"印江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260608, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"石阡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260609, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"沿河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260610, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"德江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260611, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"铜仁\", \n" +
            "            \"district\": \"松桃\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260701, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"毕节\", \n" +
            "            \"district\": \"毕节\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260702, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"毕节\", \n" +
            "            \"district\": \"赫章\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260703, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"毕节\", \n" +
            "            \"district\": \"金沙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260704, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"毕节\", \n" +
            "            \"district\": \"威宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260705, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"毕节\", \n" +
            "            \"district\": \"大方\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260706, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"毕节\", \n" +
            "            \"district\": \"纳雍\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260707, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"毕节\", \n" +
            "            \"district\": \"织金\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260708, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"毕节\", \n" +
            "            \"district\": \"黔西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260801, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"六盘水\", \n" +
            "            \"district\": \"水城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260802, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"六盘水\", \n" +
            "            \"district\": \"六枝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260804, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"六盘水\", \n" +
            "            \"district\": \"盘县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260901, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔西南\", \n" +
            "            \"district\": \"兴义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260902, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔西南\", \n" +
            "            \"district\": \"晴隆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260903, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔西南\", \n" +
            "            \"district\": \"兴仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260904, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔西南\", \n" +
            "            \"district\": \"贞丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260905, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔西南\", \n" +
            "            \"district\": \"望谟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260907, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔西南\", \n" +
            "            \"district\": \"安龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260908, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔西南\", \n" +
            "            \"district\": \"册亨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101260909, \n" +
            "            \"prov\": \"贵州\", \n" +
            "            \"city\": \"黔西南\", \n" +
            "            \"district\": \"普安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270101, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"成都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270102, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"龙泉驿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270103, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"新都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270104, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"温江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270105, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"金堂\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270106, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"双流\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270107, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"郫县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270108, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"大邑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270109, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"蒲江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270110, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"新津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270111, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"都江堰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270112, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"彭州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270113, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"邛崃\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270114, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"崇州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270115, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"成都\", \n" +
            "            \"district\": \"青白江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270201, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"攀枝花\", \n" +
            "            \"district\": \"攀枝花\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270202, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"攀枝花\", \n" +
            "            \"district\": \"仁和\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270203, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"攀枝花\", \n" +
            "            \"district\": \"米易\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270204, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"攀枝花\", \n" +
            "            \"district\": \"盐边\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270301, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"自贡\", \n" +
            "            \"district\": \"自贡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270302, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"自贡\", \n" +
            "            \"district\": \"富顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270303, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"自贡\", \n" +
            "            \"district\": \"荣县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270401, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"绵阳\", \n" +
            "            \"district\": \"绵阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270402, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"绵阳\", \n" +
            "            \"district\": \"三台\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270403, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"绵阳\", \n" +
            "            \"district\": \"盐亭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270404, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"绵阳\", \n" +
            "            \"district\": \"安县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270405, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"绵阳\", \n" +
            "            \"district\": \"梓潼\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270406, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"绵阳\", \n" +
            "            \"district\": \"北川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270407, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"绵阳\", \n" +
            "            \"district\": \"平武\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270408, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"绵阳\", \n" +
            "            \"district\": \"江油\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270501, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"南充\", \n" +
            "            \"district\": \"南充\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270502, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"南充\", \n" +
            "            \"district\": \"南部\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270503, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"南充\", \n" +
            "            \"district\": \"营山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270504, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"南充\", \n" +
            "            \"district\": \"蓬安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270505, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"南充\", \n" +
            "            \"district\": \"仪陇\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270506, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"南充\", \n" +
            "            \"district\": \"西充\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270507, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"南充\", \n" +
            "            \"district\": \"阆中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270601, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"达州\", \n" +
            "            \"district\": \"达州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270602, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"达州\", \n" +
            "            \"district\": \"宣汉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270603, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"达州\", \n" +
            "            \"district\": \"开江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270604, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"达州\", \n" +
            "            \"district\": \"大竹\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270605, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"达州\", \n" +
            "            \"district\": \"渠县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270606, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"达州\", \n" +
            "            \"district\": \"万源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270607, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"达州\", \n" +
            "            \"district\": \"通川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270608, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"达州\", \n" +
            "            \"district\": \"达县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270701, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"遂宁\", \n" +
            "            \"district\": \"遂宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270702, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"遂宁\", \n" +
            "            \"district\": \"蓬溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270703, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"遂宁\", \n" +
            "            \"district\": \"射洪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270801, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广安\", \n" +
            "            \"district\": \"广安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270802, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广安\", \n" +
            "            \"district\": \"岳池\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270803, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广安\", \n" +
            "            \"district\": \"武胜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270804, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广安\", \n" +
            "            \"district\": \"邻水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270805, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广安\", \n" +
            "            \"district\": \"华蓥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270901, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"巴中\", \n" +
            "            \"district\": \"巴中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270902, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"巴中\", \n" +
            "            \"district\": \"通江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270903, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"巴中\", \n" +
            "            \"district\": \"南江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101270904, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"巴中\", \n" +
            "            \"district\": \"平昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271001, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"泸州\", \n" +
            "            \"district\": \"泸州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271003, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"泸州\", \n" +
            "            \"district\": \"泸县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271004, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"泸州\", \n" +
            "            \"district\": \"合江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271005, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"泸州\", \n" +
            "            \"district\": \"叙永\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271006, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"泸州\", \n" +
            "            \"district\": \"古蔺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271007, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"泸州\", \n" +
            "            \"district\": \"纳溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271101, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"宜宾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271103, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"宜宾县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271104, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"南溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271105, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"江安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271106, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"长宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271107, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"高县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271108, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"珙县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271109, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"筠连\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271110, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"兴文\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271111, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"宜宾\", \n" +
            "            \"district\": \"屏山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271201, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"内江\", \n" +
            "            \"district\": \"内江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271202, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"内江\", \n" +
            "            \"district\": \"东兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271203, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"内江\", \n" +
            "            \"district\": \"威远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271204, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"内江\", \n" +
            "            \"district\": \"资中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271205, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"内江\", \n" +
            "            \"district\": \"隆昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271301, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"资阳\", \n" +
            "            \"district\": \"资阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271302, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"资阳\", \n" +
            "            \"district\": \"安岳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271303, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"资阳\", \n" +
            "            \"district\": \"乐至\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271304, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"资阳\", \n" +
            "            \"district\": \"简阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271401, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"乐山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271402, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"犍为\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271403, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"井研\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271404, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"夹江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271405, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"沐川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271406, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"峨边\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271407, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"马边\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271408, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"峨眉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271409, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"乐山\", \n" +
            "            \"district\": \"峨眉山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271501, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"眉山\", \n" +
            "            \"district\": \"眉山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271502, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"眉山\", \n" +
            "            \"district\": \"仁寿\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271503, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"眉山\", \n" +
            "            \"district\": \"彭山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271504, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"眉山\", \n" +
            "            \"district\": \"洪雅\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271505, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"眉山\", \n" +
            "            \"district\": \"丹棱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271506, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"眉山\", \n" +
            "            \"district\": \"青神\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271601, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"凉山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271603, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"木里\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271604, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"盐源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271605, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"德昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271606, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"会理\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271607, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"会东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271608, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"宁南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271609, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"普格\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271610, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"西昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271611, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"金阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271612, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"昭觉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271613, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"喜德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271614, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"冕宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271615, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"越西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271616, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"甘洛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271617, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"雷波\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271618, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"美姑\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271619, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"凉山\", \n" +
            "            \"district\": \"布拖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271701, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"雅安\", \n" +
            "            \"district\": \"雅安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271702, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"雅安\", \n" +
            "            \"district\": \"名山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271703, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"雅安\", \n" +
            "            \"district\": \"荥经\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271704, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"雅安\", \n" +
            "            \"district\": \"汉源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271705, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"雅安\", \n" +
            "            \"district\": \"石棉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271706, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"雅安\", \n" +
            "            \"district\": \"天全\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271707, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"雅安\", \n" +
            "            \"district\": \"芦山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271708, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"雅安\", \n" +
            "            \"district\": \"宝兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271801, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"甘孜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271802, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"康定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271803, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"泸定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271804, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"丹巴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271805, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"九龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271806, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"雅江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271807, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"道孚\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271808, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"炉霍\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271809, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"新龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271810, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"德格\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271811, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"白玉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271812, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"石渠\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271813, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"色达\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271814, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"理塘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271815, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"巴塘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271816, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"乡城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271817, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"稻城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271818, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"甘孜\", \n" +
            "            \"district\": \"得荣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271901, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"阿坝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271902, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"汶川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271903, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"理县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271904, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"茂县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271905, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"松潘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271906, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"九寨沟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271907, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"金川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271908, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"小金\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271909, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"黑水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271910, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"马尔康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271911, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"壤塘\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271912, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"若尔盖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101271913, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"阿坝\", \n" +
            "            \"district\": \"红原\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272001, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"德阳\", \n" +
            "            \"district\": \"德阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272002, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"德阳\", \n" +
            "            \"district\": \"中江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272003, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"德阳\", \n" +
            "            \"district\": \"广汉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272004, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"德阳\", \n" +
            "            \"district\": \"什邡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272005, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"德阳\", \n" +
            "            \"district\": \"绵竹\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272006, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"德阳\", \n" +
            "            \"district\": \"罗江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272101, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广元\", \n" +
            "            \"district\": \"广元\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272102, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广元\", \n" +
            "            \"district\": \"旺苍\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272103, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广元\", \n" +
            "            \"district\": \"青川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272104, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广元\", \n" +
            "            \"district\": \"剑阁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101272105, \n" +
            "            \"prov\": \"四川\", \n" +
            "            \"city\": \"广元\", \n" +
            "            \"district\": \"苍溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280101, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"广州\", \n" +
            "            \"district\": \"广州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280102, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"广州\", \n" +
            "            \"district\": \"番禺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280103, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"广州\", \n" +
            "            \"district\": \"从化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280104, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"广州\", \n" +
            "            \"district\": \"增城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280105, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"广州\", \n" +
            "            \"district\": \"花都\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280201, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"韶关\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280202, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"乳源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280203, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"始兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280204, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"翁源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280205, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"乐昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280206, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"仁化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280207, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"南雄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280208, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"新丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280209, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"曲江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280210, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"浈江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280211, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"韶关\", \n" +
            "            \"district\": \"武江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280301, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"惠州\", \n" +
            "            \"district\": \"惠州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280302, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"惠州\", \n" +
            "            \"district\": \"博罗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280303, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"惠州\", \n" +
            "            \"district\": \"惠阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280304, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"惠州\", \n" +
            "            \"district\": \"惠东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280305, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"惠州\", \n" +
            "            \"district\": \"龙门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280401, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"梅州\", \n" +
            "            \"district\": \"梅州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280402, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"梅州\", \n" +
            "            \"district\": \"兴宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280403, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"梅州\", \n" +
            "            \"district\": \"蕉岭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280404, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"梅州\", \n" +
            "            \"district\": \"大埔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280406, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"梅州\", \n" +
            "            \"district\": \"丰顺\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280407, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"梅州\", \n" +
            "            \"district\": \"平远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280408, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"梅州\", \n" +
            "            \"district\": \"五华\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280409, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"梅州\", \n" +
            "            \"district\": \"梅县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280501, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"汕头\", \n" +
            "            \"district\": \"汕头\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280502, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"汕头\", \n" +
            "            \"district\": \"潮阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280503, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"汕头\", \n" +
            "            \"district\": \"澄海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280504, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"汕头\", \n" +
            "            \"district\": \"南澳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280601, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"深圳\", \n" +
            "            \"district\": \"深圳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280701, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"珠海\", \n" +
            "            \"district\": \"珠海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280702, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"珠海\", \n" +
            "            \"district\": \"斗门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280703, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"珠海\", \n" +
            "            \"district\": \"金湾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280800, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"佛山\", \n" +
            "            \"district\": \"佛山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280801, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"佛山\", \n" +
            "            \"district\": \"顺德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280802, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"佛山\", \n" +
            "            \"district\": \"三水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280803, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"佛山\", \n" +
            "            \"district\": \"南海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280804, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"佛山\", \n" +
            "            \"district\": \"高明\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280901, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"肇庆\", \n" +
            "            \"district\": \"肇庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280902, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"肇庆\", \n" +
            "            \"district\": \"广宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280903, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"肇庆\", \n" +
            "            \"district\": \"四会\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280905, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"肇庆\", \n" +
            "            \"district\": \"德庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280906, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"肇庆\", \n" +
            "            \"district\": \"怀集\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280907, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"肇庆\", \n" +
            "            \"district\": \"封开\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101280908, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"肇庆\", \n" +
            "            \"district\": \"高要\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281001, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"湛江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281002, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"吴川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281003, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"雷州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281004, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"徐闻\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281005, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"廉江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281006, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"赤坎\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281007, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"遂溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281008, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"坡头\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281009, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"霞山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281010, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"湛江\", \n" +
            "            \"district\": \"麻章\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281101, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"江门\", \n" +
            "            \"district\": \"江门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281103, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"江门\", \n" +
            "            \"district\": \"开平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281104, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"江门\", \n" +
            "            \"district\": \"新会\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281105, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"江门\", \n" +
            "            \"district\": \"恩平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281106, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"江门\", \n" +
            "            \"district\": \"台山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281107, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"江门\", \n" +
            "            \"district\": \"蓬江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281108, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"江门\", \n" +
            "            \"district\": \"鹤山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281109, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"江门\", \n" +
            "            \"district\": \"江海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281201, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"河源\", \n" +
            "            \"district\": \"河源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281202, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"河源\", \n" +
            "            \"district\": \"紫金\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281203, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"河源\", \n" +
            "            \"district\": \"连平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281204, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"河源\", \n" +
            "            \"district\": \"和平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281205, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"河源\", \n" +
            "            \"district\": \"龙川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281206, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"河源\", \n" +
            "            \"district\": \"东源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281301, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"清远\", \n" +
            "            \"district\": \"清远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281302, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"清远\", \n" +
            "            \"district\": \"连南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281303, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"清远\", \n" +
            "            \"district\": \"连州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281304, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"清远\", \n" +
            "            \"district\": \"连山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281305, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"清远\", \n" +
            "            \"district\": \"阳山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281306, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"清远\", \n" +
            "            \"district\": \"佛冈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281307, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"清远\", \n" +
            "            \"district\": \"英德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281308, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"清远\", \n" +
            "            \"district\": \"清新\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281401, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"云浮\", \n" +
            "            \"district\": \"云浮\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281402, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"云浮\", \n" +
            "            \"district\": \"罗定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281403, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"云浮\", \n" +
            "            \"district\": \"新兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281404, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"云浮\", \n" +
            "            \"district\": \"郁南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281406, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"云浮\", \n" +
            "            \"district\": \"云安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281501, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"潮州\", \n" +
            "            \"district\": \"潮州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281502, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"潮州\", \n" +
            "            \"district\": \"饶平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281503, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"潮州\", \n" +
            "            \"district\": \"潮安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281601, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"东莞\", \n" +
            "            \"district\": \"东莞\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281701, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"中山\", \n" +
            "            \"district\": \"中山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281801, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"阳江\", \n" +
            "            \"district\": \"阳江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281802, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"阳江\", \n" +
            "            \"district\": \"阳春\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281803, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"阳江\", \n" +
            "            \"district\": \"阳东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281804, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"阳江\", \n" +
            "            \"district\": \"阳西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281901, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"揭阳\", \n" +
            "            \"district\": \"揭阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281902, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"揭阳\", \n" +
            "            \"district\": \"揭西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281903, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"揭阳\", \n" +
            "            \"district\": \"普宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281904, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"揭阳\", \n" +
            "            \"district\": \"惠来\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101281905, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"揭阳\", \n" +
            "            \"district\": \"揭东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282001, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"茂名\", \n" +
            "            \"district\": \"茂名\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282002, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"茂名\", \n" +
            "            \"district\": \"高州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282003, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"茂名\", \n" +
            "            \"district\": \"化州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282004, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"茂名\", \n" +
            "            \"district\": \"电白\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282005, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"茂名\", \n" +
            "            \"district\": \"信宜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282006, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"茂名\", \n" +
            "            \"district\": \"茂港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282101, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"汕尾\", \n" +
            "            \"district\": \"汕尾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282102, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"汕尾\", \n" +
            "            \"district\": \"海丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282103, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"汕尾\", \n" +
            "            \"district\": \"陆丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101282104, \n" +
            "            \"prov\": \"广东\", \n" +
            "            \"city\": \"汕尾\", \n" +
            "            \"district\": \"陆河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290101, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"昆明\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290103, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"东川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290104, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"寻甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290105, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"晋宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290106, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"宜良\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290107, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"石林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290108, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"呈贡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290109, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"富民\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290110, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"嵩明\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290111, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"禄劝\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290112, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"安宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290113, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昆明\", \n" +
            "            \"district\": \"太华山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290201, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"大理\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290202, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"云龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290203, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"漾濞\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290204, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"永平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290205, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"宾川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290206, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"弥渡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290207, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"祥云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290208, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"巍山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290209, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"剑川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290210, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"洱源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290211, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"鹤庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290212, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"大理\", \n" +
            "            \"district\": \"南涧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290301, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"红河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290302, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"石屏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290303, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"建水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290304, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"弥勒\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290305, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"元阳\"\n" +
            "        }, ";
    private final static String S8="{\n" +
            "            \"areaid\": 101290306, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"绿春\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290307, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"开远\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290308, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"个旧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290309, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"蒙自\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290310, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"屏边\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290311, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"泸西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290312, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"金平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290313, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"红河\", \n" +
            "            \"district\": \"河口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290401, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"曲靖\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290402, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"沾益\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290403, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"陆良\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290404, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"富源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290405, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"马龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290406, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"师宗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290407, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"罗平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290408, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"会泽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290409, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"曲靖\", \n" +
            "            \"district\": \"宣威\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290501, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"保山\", \n" +
            "            \"district\": \"保山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290503, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"保山\", \n" +
            "            \"district\": \"龙陵\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290504, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"保山\", \n" +
            "            \"district\": \"施甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290505, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"保山\", \n" +
            "            \"district\": \"昌宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290506, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"保山\", \n" +
            "            \"district\": \"腾冲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290601, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"文山\", \n" +
            "            \"district\": \"文山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290602, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"文山\", \n" +
            "            \"district\": \"西畴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290603, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"文山\", \n" +
            "            \"district\": \"马关\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290604, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"文山\", \n" +
            "            \"district\": \"麻栗坡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290605, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"文山\", \n" +
            "            \"district\": \"砚山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290606, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"文山\", \n" +
            "            \"district\": \"丘北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290607, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"文山\", \n" +
            "            \"district\": \"广南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290608, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"文山\", \n" +
            "            \"district\": \"富宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290701, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"玉溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290702, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"澄江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290703, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"江川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290704, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"通海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290705, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"华宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290706, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"新平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290707, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"易门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290708, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"峨山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290709, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"玉溪\", \n" +
            "            \"district\": \"元江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290801, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"楚雄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290802, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"大姚\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290803, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"元谋\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290804, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"姚安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290805, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"牟定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290806, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"南华\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290807, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"武定\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290808, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"禄丰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290809, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"双柏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290810, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"楚雄\", \n" +
            "            \"district\": \"永仁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290901, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"普洱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290902, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"景谷\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290903, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"景东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290904, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"澜沧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290906, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"墨江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290907, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"江城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290908, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"孟连\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290909, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"西盟\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290911, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"镇沅\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101290912, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"普洱\", \n" +
            "            \"district\": \"宁洱\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291001, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"昭通\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291002, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"鲁甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291003, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"彝良\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291004, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"镇雄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291005, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"威信\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291006, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"巧家\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291007, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"绥江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291008, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"永善\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291009, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"盐津\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291010, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"大关\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291011, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"昭通\", \n" +
            "            \"district\": \"水富\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291101, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"临沧\", \n" +
            "            \"district\": \"临沧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291102, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"临沧\", \n" +
            "            \"district\": \"沧源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291103, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"临沧\", \n" +
            "            \"district\": \"耿马\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291104, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"临沧\", \n" +
            "            \"district\": \"双江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291105, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"临沧\", \n" +
            "            \"district\": \"凤庆\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291106, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"临沧\", \n" +
            "            \"district\": \"永德\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291107, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"临沧\", \n" +
            "            \"district\": \"云县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291108, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"临沧\", \n" +
            "            \"district\": \"镇康\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291201, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"怒江\", \n" +
            "            \"district\": \"怒江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291203, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"怒江\", \n" +
            "            \"district\": \"福贡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291204, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"怒江\", \n" +
            "            \"district\": \"兰坪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291205, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"怒江\", \n" +
            "            \"district\": \"泸水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291206, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"怒江\", \n" +
            "            \"district\": \"六库\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291207, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"怒江\", \n" +
            "            \"district\": \"贡山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291301, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"迪庆\", \n" +
            "            \"district\": \"香格里拉\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291302, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"迪庆\", \n" +
            "            \"district\": \"德钦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291303, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"迪庆\", \n" +
            "            \"district\": \"维西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291304, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"迪庆\", \n" +
            "            \"district\": \"中甸\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291401, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"丽江\", \n" +
            "            \"district\": \"丽江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291402, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"丽江\", \n" +
            "            \"district\": \"永胜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291403, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"丽江\", \n" +
            "            \"district\": \"华坪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291404, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"丽江\", \n" +
            "            \"district\": \"宁蒗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291501, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"德宏\", \n" +
            "            \"district\": \"德宏\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291503, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"德宏\", \n" +
            "            \"district\": \"陇川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291504, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"德宏\", \n" +
            "            \"district\": \"盈江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291506, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"德宏\", \n" +
            "            \"district\": \"瑞丽\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291507, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"德宏\", \n" +
            "            \"district\": \"梁河\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291508, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"德宏\", \n" +
            "            \"district\": \"芒市\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291601, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"西双版纳\", \n" +
            "            \"district\": \"景洪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291603, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"西双版纳\", \n" +
            "            \"district\": \"勐海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101291605, \n" +
            "            \"prov\": \"云南\", \n" +
            "            \"city\": \"西双版纳\", \n" +
            "            \"district\": \"勐腊\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300101, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"南宁\", \n" +
            "            \"district\": \"南宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300103, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"南宁\", \n" +
            "            \"district\": \"邕宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300104, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"南宁\", \n" +
            "            \"district\": \"横县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300105, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"南宁\", \n" +
            "            \"district\": \"隆安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300106, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"南宁\", \n" +
            "            \"district\": \"马山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300107, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"南宁\", \n" +
            "            \"district\": \"上林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300108, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"南宁\", \n" +
            "            \"district\": \"武鸣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300109, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"南宁\", \n" +
            "            \"district\": \"宾阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300201, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"崇左\", \n" +
            "            \"district\": \"崇左\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300202, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"崇左\", \n" +
            "            \"district\": \"天等\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300203, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"崇左\", \n" +
            "            \"district\": \"龙州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300204, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"崇左\", \n" +
            "            \"district\": \"凭祥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300205, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"崇左\", \n" +
            "            \"district\": \"大新\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300206, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"崇左\", \n" +
            "            \"district\": \"扶绥\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300207, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"崇左\", \n" +
            "            \"district\": \"宁明\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300301, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"柳州\", \n" +
            "            \"district\": \"柳州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300302, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"柳州\", \n" +
            "            \"district\": \"柳城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300304, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"柳州\", \n" +
            "            \"district\": \"鹿寨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300305, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"柳州\", \n" +
            "            \"district\": \"柳江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300306, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"柳州\", \n" +
            "            \"district\": \"融安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300307, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"柳州\", \n" +
            "            \"district\": \"融水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300308, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"柳州\", \n" +
            "            \"district\": \"三江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300401, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"来宾\", \n" +
            "            \"district\": \"来宾\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300402, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"来宾\", \n" +
            "            \"district\": \"忻城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300403, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"来宾\", \n" +
            "            \"district\": \"金秀\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300404, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"来宾\", \n" +
            "            \"district\": \"象州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300405, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"来宾\", \n" +
            "            \"district\": \"武宣\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300406, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"来宾\", \n" +
            "            \"district\": \"合山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300501, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"桂林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300503, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"龙胜\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300504, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"永福\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300505, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"临桂\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300506, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"兴安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300507, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"灵川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300508, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"全州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300509, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"灌阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300510, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"阳朔\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300511, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"恭城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300512, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"平乐\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300513, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"荔浦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300514, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"桂林\", \n" +
            "            \"district\": \"资源\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300601, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"梧州\", \n" +
            "            \"district\": \"梧州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300602, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"梧州\", \n" +
            "            \"district\": \"藤县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300604, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"梧州\", \n" +
            "            \"district\": \"苍梧\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300605, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"梧州\", \n" +
            "            \"district\": \"蒙山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300606, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"梧州\", \n" +
            "            \"district\": \"岑溪\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300701, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"贺州\", \n" +
            "            \"district\": \"贺州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300702, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"贺州\", \n" +
            "            \"district\": \"昭平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300703, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"贺州\", \n" +
            "            \"district\": \"富川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300704, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"贺州\", \n" +
            "            \"district\": \"钟山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300801, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"贵港\", \n" +
            "            \"district\": \"贵港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300802, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"贵港\", \n" +
            "            \"district\": \"桂平\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300803, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"贵港\", \n" +
            "            \"district\": \"平南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300901, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"玉林\", \n" +
            "            \"district\": \"玉林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300902, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"玉林\", \n" +
            "            \"district\": \"博白\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300903, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"玉林\", \n" +
            "            \"district\": \"北流\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300904, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"玉林\", \n" +
            "            \"district\": \"容县\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300905, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"玉林\", \n" +
            "            \"district\": \"陆川\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101300906, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"玉林\", \n" +
            "            \"district\": \"兴业\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301001, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"百色\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301002, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"那坡\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301003, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"田阳\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301004, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"德保\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301005, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"靖西\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301006, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"田东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301007, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"平果\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301008, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"隆林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301009, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"西林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301010, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"乐业\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301011, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"凌云\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301012, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"百色\", \n" +
            "            \"district\": \"田林\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301101, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"钦州\", \n" +
            "            \"district\": \"钦州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301102, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"钦州\", \n" +
            "            \"district\": \"浦北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301103, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"钦州\", \n" +
            "            \"district\": \"灵山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301201, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"河池\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301202, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"天峨\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301203, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"东兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301204, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"巴马\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301205, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"环江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301206, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"罗城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301207, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"宜州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301208, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"凤山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301209, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"南丹\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301210, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"都安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301211, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"河池\", \n" +
            "            \"district\": \"大化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301301, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"北海\", \n" +
            "            \"district\": \"北海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301302, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"北海\", \n" +
            "            \"district\": \"合浦\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301303, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"北海\", \n" +
            "            \"district\": \"涠洲岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301401, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"防城港\", \n" +
            "            \"district\": \"防城港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301402, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"防城港\", \n" +
            "            \"district\": \"上思\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301403, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"防城港\", \n" +
            "            \"district\": \"东兴\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101301405, \n" +
            "            \"prov\": \"广西\", \n" +
            "            \"city\": \"防城港\", \n" +
            "            \"district\": \"防城\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310101, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"海口\", \n" +
            "            \"district\": \"海口\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310201, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"三亚\", \n" +
            "            \"district\": \"三亚\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310202, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"东方\", \n" +
            "            \"district\": \"东方\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310203, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"临高\", \n" +
            "            \"district\": \"临高\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310204, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"澄迈\", \n" +
            "            \"district\": \"澄迈\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310205, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"儋州\", \n" +
            "            \"district\": \"儋州\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310206, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"昌江\", \n" +
            "            \"district\": \"昌江\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310207, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"白沙\", \n" +
            "            \"district\": \"白沙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310208, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"琼中\", \n" +
            "            \"district\": \"琼中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310209, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"定安\", \n" +
            "            \"district\": \"定安\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310210, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"屯昌\", \n" +
            "            \"district\": \"屯昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310211, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"琼海\", \n" +
            "            \"district\": \"琼海\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310212, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"文昌\", \n" +
            "            \"district\": \"文昌\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310214, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"保亭\", \n" +
            "            \"district\": \"保亭\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310215, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"万宁\", \n" +
            "            \"district\": \"万宁\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310216, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"陵水\", \n" +
            "            \"district\": \"陵水\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310217, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"西沙\", \n" +
            "            \"district\": \"西沙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310220, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"南沙\", \n" +
            "            \"district\": \"南沙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310221, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"乐东\", \n" +
            "            \"district\": \"乐东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310222, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"五指山\", \n" +
            "            \"district\": \"五指山\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310224, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"中沙\", \n" +
            "            \"district\": \"中沙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101310230, \n" +
            "            \"prov\": \"海南\", \n" +
            "            \"city\": \"南子岛\", \n" +
            "            \"district\": \"南子岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101320101, \n" +
            "            \"prov\": \"香港\", \n" +
            "            \"city\": \"香港\", \n" +
            "            \"district\": \"香港\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101320102, \n" +
            "            \"prov\": \"香港\", \n" +
            "            \"city\": \"香港\", \n" +
            "            \"district\": \"九龙\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101320103, \n" +
            "            \"prov\": \"香港\", \n" +
            "            \"city\": \"香港\", \n" +
            "            \"district\": \"新界\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101330101, \n" +
            "            \"prov\": \"澳门\", \n" +
            "            \"city\": \"澳门\", \n" +
            "            \"district\": \"澳门\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101330102, \n" +
            "            \"prov\": \"澳门\", \n" +
            "            \"city\": \"澳门\", \n" +
            "            \"district\": \"氹仔岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101330103, \n" +
            "            \"prov\": \"澳门\", \n" +
            "            \"city\": \"澳门\", \n" +
            "            \"district\": \"路环岛\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340101, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台北\", \n" +
            "            \"district\": \"台北\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340102, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台北\", \n" +
            "            \"district\": \"桃园\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340103, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台北\", \n" +
            "            \"district\": \"新竹\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340104, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台北\", \n" +
            "            \"district\": \"宜兰\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340201, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"高雄\", \n" +
            "            \"district\": \"高雄\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340202, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"高雄\", \n" +
            "            \"district\": \"嘉义\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340203, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"高雄\", \n" +
            "            \"district\": \"台南\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340204, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"高雄\", \n" +
            "            \"district\": \"台东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340205, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"高雄\", \n" +
            "            \"district\": \"屏东\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340401, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台中\", \n" +
            "            \"district\": \"台中\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340402, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台中\", \n" +
            "            \"district\": \"苗栗\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340403, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台中\", \n" +
            "            \"district\": \"彰化\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340404, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台中\", \n" +
            "            \"district\": \"南投\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340405, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台中\", \n" +
            "            \"district\": \"花莲\"\n" +
            "        }, \n" +
            "        {\n" +
            "            \"areaid\": 101340406, \n" +
            "            \"prov\": \"台湾\", \n" +
            "            \"city\": \"台中\", \n" +
            "            \"district\": \"云林\"\n" +
            "        }\n" +
            "    ]\n" +
            "}";

}